/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const _IOC_NRBITS: u32 = 8;
pub const _IOC_TYPEBITS: u32 = 8;
pub const _IOC_SIZEBITS: u32 = 14;
pub const _IOC_DIRBITS: u32 = 2;
pub const _IOC_NRMASK: u32 = 255;
pub const _IOC_TYPEMASK: u32 = 255;
pub const _IOC_SIZEMASK: u32 = 16383;
pub const _IOC_DIRMASK: u32 = 3;
pub const _IOC_NRSHIFT: u32 = 0;
pub const _IOC_TYPESHIFT: u32 = 8;
pub const _IOC_SIZESHIFT: u32 = 16;
pub const _IOC_DIRSHIFT: u32 = 30;

pub const KVM_REG_LOONGARCH: i64 = -8070450532247928832;
pub const KVM_REG_SIZE_SHIFT: u32 = 52;
pub const KVM_REG_SIZE_MASK: u64 = 67553994410557440;
pub const KVM_REG_SIZE_U8: u32 = 0;
pub const KVM_REG_SIZE_U16: u64 = 4503599627370496;
pub const KVM_REG_SIZE_U32: u64 = 9007199254740992;
pub const KVM_REG_SIZE_U64: u64 = 13510798882111488;
pub const KVM_REG_SIZE_U128: u64 = 18014398509481984;
pub const KVM_REG_SIZE_U256: u64 = 22517998136852480;
pub const KVM_REG_SIZE_U512: u64 = 27021597764222976;
pub const KVM_REG_SIZE_U1024: u64 = 31525197391593472;
pub const KVM_REG_SIZE_U2048: u64 = 36028797018963968;
pub const KVM_MSI_VALID_DEVID: u32 = 1;
pub const KVM_CREATE_DEVICE_TEST: u32 = 1;
pub const KVM_DEV_VFIO_FILE: u32 = 1;
pub const KVM_DEV_VFIO_FILE_ADD: u32 = 1;
pub const KVM_DEV_VFIO_FILE_DEL: u32 = 2;
pub const KVM_DEV_VFIO_GROUP: u32 = 1;
pub const KVM_DEV_VFIO_GROUP_ADD: u32 = 1;
pub const KVM_DEV_VFIO_GROUP_DEL: u32 = 2;
pub const KVM_DEV_VFIO_GROUP_SET_SPAPR_TCE: u32 = 3;
pub const KVM_S390_STORE_STATUS_NOADDR: i32 = -1;
pub const KVM_S390_STORE_STATUS_PREFIXED: i32 = -2;
pub const KVM_DIRTY_LOG_MANUAL_PROTECT_ENABLE: u32 = 1;
pub const KVM_DIRTY_LOG_INITIALLY_SET: u32 = 2;
pub const KVM_DIRTY_LOG_PAGE_OFFSET: u32 = 0;
pub const KVM_DIRTY_GFN_F_MASK: u32 = 3;
pub const KVM_BUS_LOCK_DETECTION_OFF: u32 = 1;
pub const KVM_BUS_LOCK_DETECTION_EXIT: u32 = 2;
pub const KVM_PMU_CAP_DISABLE: u32 = 1;
pub const KVM_STATS_TYPE_SHIFT: u32 = 0;
pub const KVM_STATS_TYPE_MASK: u32 = 15;
pub const KVM_STATS_TYPE_CUMULATIVE: u32 = 0;
pub const KVM_STATS_TYPE_INSTANT: u32 = 1;
pub const KVM_STATS_TYPE_PEAK: u32 = 2;
pub const KVM_STATS_TYPE_LINEAR_HIST: u32 = 3;
pub const KVM_STATS_TYPE_LOG_HIST: u32 = 4;
pub const KVM_STATS_TYPE_MAX: u32 = 4;
pub const KVM_STATS_UNIT_SHIFT: u32 = 4;
pub const KVM_STATS_UNIT_MASK: u32 = 240;
pub const KVM_STATS_UNIT_NONE: u32 = 0;
pub const KVM_STATS_UNIT_BYTES: u32 = 16;
pub const KVM_STATS_UNIT_SECONDS: u32 = 32;
pub const KVM_STATS_UNIT_CYCLES: u32 = 48;
pub const KVM_STATS_UNIT_BOOLEAN: u32 = 64;
pub const KVM_STATS_UNIT_MAX: u32 = 64;
pub const KVM_STATS_BASE_SHIFT: u32 = 8;
pub const KVM_STATS_BASE_MASK: u32 = 3840;
pub const KVM_STATS_BASE_POW10: u32 = 0;
pub const KVM_STATS_BASE_POW2: u32 = 256;
pub const KVM_STATS_BASE_MAX: u32 = 256;
pub const KVM_X86_NOTIFY_VMEXIT_ENABLED: u32 = 1;
pub const KVM_X86_NOTIFY_VMEXIT_USER: u32 = 2;
pub const KVM_MEMORY_ATTRIBUTE_PRIVATE: u32 = 8;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_old_uid_t = __kernel_uid_t;
pub type __kernel_old_gid_t = __kernel_gid_t;
pub type __kernel_old_dev_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct user_regs_struct {
    pub pc: ::std::os::raw::c_ulong,
    pub ra: ::std::os::raw::c_ulong,
    pub sp: ::std::os::raw::c_ulong,
    pub gp: ::std::os::raw::c_ulong,
    pub tp: ::std::os::raw::c_ulong,
    pub t0: ::std::os::raw::c_ulong,
    pub t1: ::std::os::raw::c_ulong,
    pub t2: ::std::os::raw::c_ulong,
    pub s0: ::std::os::raw::c_ulong,
    pub s1: ::std::os::raw::c_ulong,
    pub a0: ::std::os::raw::c_ulong,
    pub a1: ::std::os::raw::c_ulong,
    pub a2: ::std::os::raw::c_ulong,
    pub a3: ::std::os::raw::c_ulong,
    pub a4: ::std::os::raw::c_ulong,
    pub a5: ::std::os::raw::c_ulong,
    pub a6: ::std::os::raw::c_ulong,
    pub a7: ::std::os::raw::c_ulong,
    pub s2: ::std::os::raw::c_ulong,
    pub s3: ::std::os::raw::c_ulong,
    pub s4: ::std::os::raw::c_ulong,
    pub s5: ::std::os::raw::c_ulong,
    pub s6: ::std::os::raw::c_ulong,
    pub s7: ::std::os::raw::c_ulong,
    pub s8: ::std::os::raw::c_ulong,
    pub s9: ::std::os::raw::c_ulong,
    pub s10: ::std::os::raw::c_ulong,
    pub s11: ::std::os::raw::c_ulong,
    pub t3: ::std::os::raw::c_ulong,
    pub t4: ::std::os::raw::c_ulong,
    pub t5: ::std::os::raw::c_ulong,
    pub t6: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of user_regs_struct"][::std::mem::size_of::<user_regs_struct>() - 256usize];
    ["Alignment of user_regs_struct"][::std::mem::align_of::<user_regs_struct>() - 8usize];
    ["Offset of field: user_regs_struct::pc"]
        [::std::mem::offset_of!(user_regs_struct, pc) - 0usize];
    ["Offset of field: user_regs_struct::ra"]
        [::std::mem::offset_of!(user_regs_struct, ra) - 8usize];
    ["Offset of field: user_regs_struct::sp"]
        [::std::mem::offset_of!(user_regs_struct, sp) - 16usize];
    ["Offset of field: user_regs_struct::gp"]
        [::std::mem::offset_of!(user_regs_struct, gp) - 24usize];
    ["Offset of field: user_regs_struct::tp"]
        [::std::mem::offset_of!(user_regs_struct, tp) - 32usize];
    ["Offset of field: user_regs_struct::t0"]
        [::std::mem::offset_of!(user_regs_struct, t0) - 40usize];
    ["Offset of field: user_regs_struct::t1"]
        [::std::mem::offset_of!(user_regs_struct, t1) - 48usize];
    ["Offset of field: user_regs_struct::t2"]
        [::std::mem::offset_of!(user_regs_struct, t2) - 56usize];
    ["Offset of field: user_regs_struct::s0"]
        [::std::mem::offset_of!(user_regs_struct, s0) - 64usize];
    ["Offset of field: user_regs_struct::s1"]
        [::std::mem::offset_of!(user_regs_struct, s1) - 72usize];
    ["Offset of field: user_regs_struct::a0"]
        [::std::mem::offset_of!(user_regs_struct, a0) - 80usize];
    ["Offset of field: user_regs_struct::a1"]
        [::std::mem::offset_of!(user_regs_struct, a1) - 88usize];
    ["Offset of field: user_regs_struct::a2"]
        [::std::mem::offset_of!(user_regs_struct, a2) - 96usize];
    ["Offset of field: user_regs_struct::a3"]
        [::std::mem::offset_of!(user_regs_struct, a3) - 104usize];
    ["Offset of field: user_regs_struct::a4"]
        [::std::mem::offset_of!(user_regs_struct, a4) - 112usize];
    ["Offset of field: user_regs_struct::a5"]
        [::std::mem::offset_of!(user_regs_struct, a5) - 120usize];
    ["Offset of field: user_regs_struct::a6"]
        [::std::mem::offset_of!(user_regs_struct, a6) - 128usize];
    ["Offset of field: user_regs_struct::a7"]
        [::std::mem::offset_of!(user_regs_struct, a7) - 136usize];
    ["Offset of field: user_regs_struct::s2"]
        [::std::mem::offset_of!(user_regs_struct, s2) - 144usize];
    ["Offset of field: user_regs_struct::s3"]
        [::std::mem::offset_of!(user_regs_struct, s3) - 152usize];
    ["Offset of field: user_regs_struct::s4"]
        [::std::mem::offset_of!(user_regs_struct, s4) - 160usize];
    ["Offset of field: user_regs_struct::s5"]
        [::std::mem::offset_of!(user_regs_struct, s5) - 168usize];
    ["Offset of field: user_regs_struct::s6"]
        [::std::mem::offset_of!(user_regs_struct, s6) - 176usize];
    ["Offset of field: user_regs_struct::s7"]
        [::std::mem::offset_of!(user_regs_struct, s7) - 184usize];
    ["Offset of field: user_regs_struct::s8"]
        [::std::mem::offset_of!(user_regs_struct, s8) - 192usize];
    ["Offset of field: user_regs_struct::s9"]
        [::std::mem::offset_of!(user_regs_struct, s9) - 200usize];
    ["Offset of field: user_regs_struct::s10"]
        [::std::mem::offset_of!(user_regs_struct, s10) - 208usize];
    ["Offset of field: user_regs_struct::s11"]
        [::std::mem::offset_of!(user_regs_struct, s11) - 216usize];
    ["Offset of field: user_regs_struct::t3"]
        [::std::mem::offset_of!(user_regs_struct, t3) - 224usize];
    ["Offset of field: user_regs_struct::t4"]
        [::std::mem::offset_of!(user_regs_struct, t4) - 232usize];
    ["Offset of field: user_regs_struct::t5"]
        [::std::mem::offset_of!(user_regs_struct, t5) - 240usize];
    ["Offset of field: user_regs_struct::t6"]
        [::std::mem::offset_of!(user_regs_struct, t6) - 248usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __riscv_f_ext_state {
    pub f: [__u32; 32usize],
    pub fcsr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_f_ext_state"][::std::mem::size_of::<__riscv_f_ext_state>() - 132usize];
    ["Alignment of __riscv_f_ext_state"][::std::mem::align_of::<__riscv_f_ext_state>() - 4usize];
    ["Offset of field: __riscv_f_ext_state::f"]
        [::std::mem::offset_of!(__riscv_f_ext_state, f) - 0usize];
    ["Offset of field: __riscv_f_ext_state::fcsr"]
        [::std::mem::offset_of!(__riscv_f_ext_state, fcsr) - 128usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __riscv_d_ext_state {
    pub f: [__u64; 32usize],
    pub fcsr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_d_ext_state"][::std::mem::size_of::<__riscv_d_ext_state>() - 264usize];
    ["Alignment of __riscv_d_ext_state"][::std::mem::align_of::<__riscv_d_ext_state>() - 8usize];
    ["Offset of field: __riscv_d_ext_state::f"]
        [::std::mem::offset_of!(__riscv_d_ext_state, f) - 0usize];
    ["Offset of field: __riscv_d_ext_state::fcsr"]
        [::std::mem::offset_of!(__riscv_d_ext_state, fcsr) - 256usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __riscv_q_ext_state {
    pub f: [__u64; 64usize],
    pub fcsr: __u32,
    pub reserved: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_q_ext_state"][::std::mem::size_of::<__riscv_q_ext_state>() - 528usize];
    ["Alignment of __riscv_q_ext_state"][::std::mem::align_of::<__riscv_q_ext_state>() - 16usize];
    ["Offset of field: __riscv_q_ext_state::f"]
        [::std::mem::offset_of!(__riscv_q_ext_state, f) - 0usize];
    ["Offset of field: __riscv_q_ext_state::fcsr"]
        [::std::mem::offset_of!(__riscv_q_ext_state, fcsr) - 512usize];
    ["Offset of field: __riscv_q_ext_state::reserved"]
        [::std::mem::offset_of!(__riscv_q_ext_state, reserved) - 516usize];
};
impl Default for __riscv_q_ext_state {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __riscv_ctx_hdr {
    pub magic: __u32,
    pub size: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_ctx_hdr"][::std::mem::size_of::<__riscv_ctx_hdr>() - 8usize];
    ["Alignment of __riscv_ctx_hdr"][::std::mem::align_of::<__riscv_ctx_hdr>() - 4usize];
    ["Offset of field: __riscv_ctx_hdr::magic"]
        [::std::mem::offset_of!(__riscv_ctx_hdr, magic) - 0usize];
    ["Offset of field: __riscv_ctx_hdr::size"]
        [::std::mem::offset_of!(__riscv_ctx_hdr, size) - 4usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __riscv_extra_ext_header {
    pub __padding: [__u32; 129usize],
    pub reserved: __u32,
    pub hdr: __riscv_ctx_hdr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_extra_ext_header"]
        [::std::mem::size_of::<__riscv_extra_ext_header>() - 528usize];
    ["Alignment of __riscv_extra_ext_header"]
        [::std::mem::align_of::<__riscv_extra_ext_header>() - 16usize];
    ["Offset of field: __riscv_extra_ext_header::__padding"]
        [::std::mem::offset_of!(__riscv_extra_ext_header, __padding) - 0usize];
    ["Offset of field: __riscv_extra_ext_header::reserved"]
        [::std::mem::offset_of!(__riscv_extra_ext_header, reserved) - 516usize];
    ["Offset of field: __riscv_extra_ext_header::hdr"]
        [::std::mem::offset_of!(__riscv_extra_ext_header, hdr) - 520usize];
};
impl Default for __riscv_extra_ext_header {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union __riscv_fp_state {
    pub f: __riscv_f_ext_state,
    pub d: __riscv_d_ext_state,
    pub q: __riscv_q_ext_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_fp_state"][::std::mem::size_of::<__riscv_fp_state>() - 528usize];
    ["Alignment of __riscv_fp_state"][::std::mem::align_of::<__riscv_fp_state>() - 16usize];
    ["Offset of field: __riscv_fp_state::f"][::std::mem::offset_of!(__riscv_fp_state, f) - 0usize];
    ["Offset of field: __riscv_fp_state::d"][::std::mem::offset_of!(__riscv_fp_state, d) - 0usize];
    ["Offset of field: __riscv_fp_state::q"][::std::mem::offset_of!(__riscv_fp_state, q) - 0usize];
};
impl Default for __riscv_fp_state {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for __riscv_fp_state {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "__riscv_fp_state {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __riscv_v_ext_state {
    pub vstart: ::std::os::raw::c_ulong,
    pub vl: ::std::os::raw::c_ulong,
    pub vtype: ::std::os::raw::c_ulong,
    pub vcsr: ::std::os::raw::c_ulong,
    pub vlenb: ::std::os::raw::c_ulong,
    pub datap: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_v_ext_state"][::std::mem::size_of::<__riscv_v_ext_state>() - 48usize];
    ["Alignment of __riscv_v_ext_state"][::std::mem::align_of::<__riscv_v_ext_state>() - 8usize];
    ["Offset of field: __riscv_v_ext_state::vstart"]
        [::std::mem::offset_of!(__riscv_v_ext_state, vstart) - 0usize];
    ["Offset of field: __riscv_v_ext_state::vl"]
        [::std::mem::offset_of!(__riscv_v_ext_state, vl) - 8usize];
    ["Offset of field: __riscv_v_ext_state::vtype"]
        [::std::mem::offset_of!(__riscv_v_ext_state, vtype) - 16usize];
    ["Offset of field: __riscv_v_ext_state::vcsr"]
        [::std::mem::offset_of!(__riscv_v_ext_state, vcsr) - 24usize];
    ["Offset of field: __riscv_v_ext_state::vlenb"]
        [::std::mem::offset_of!(__riscv_v_ext_state, vlenb) - 32usize];
    ["Offset of field: __riscv_v_ext_state::datap"]
        [::std::mem::offset_of!(__riscv_v_ext_state, datap) - 40usize];
};
impl Default for __riscv_v_ext_state {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct __riscv_v_regset_state {
    pub vstart: ::std::os::raw::c_ulong,
    pub vl: ::std::os::raw::c_ulong,
    pub vtype: ::std::os::raw::c_ulong,
    pub vcsr: ::std::os::raw::c_ulong,
    pub vlenb: ::std::os::raw::c_ulong,
    pub vreg: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __riscv_v_regset_state"][::std::mem::size_of::<__riscv_v_regset_state>() - 40usize];
    ["Alignment of __riscv_v_regset_state"]
        [::std::mem::align_of::<__riscv_v_regset_state>() - 8usize];
    ["Offset of field: __riscv_v_regset_state::vstart"]
        [::std::mem::offset_of!(__riscv_v_regset_state, vstart) - 0usize];
    ["Offset of field: __riscv_v_regset_state::vl"]
        [::std::mem::offset_of!(__riscv_v_regset_state, vl) - 8usize];
    ["Offset of field: __riscv_v_regset_state::vtype"]
        [::std::mem::offset_of!(__riscv_v_regset_state, vtype) - 16usize];
    ["Offset of field: __riscv_v_regset_state::vcsr"]
        [::std::mem::offset_of!(__riscv_v_regset_state, vcsr) - 24usize];
    ["Offset of field: __riscv_v_regset_state::vlenb"]
        [::std::mem::offset_of!(__riscv_v_regset_state, vlenb) - 32usize];
    ["Offset of field: __riscv_v_regset_state::vreg"]
        [::std::mem::offset_of!(__riscv_v_regset_state, vreg) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_regs {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_regs"][::std::mem::size_of::<kvm_regs>() - 0usize];
    ["Alignment of kvm_regs"][::std::mem::align_of::<kvm_regs>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_fpu {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_fpu"][::std::mem::size_of::<kvm_fpu>() - 0usize];
    ["Alignment of kvm_fpu"][::std::mem::align_of::<kvm_fpu>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_debug_exit_arch {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_debug_exit_arch"][::std::mem::size_of::<kvm_debug_exit_arch>() - 0usize];
    ["Alignment of kvm_debug_exit_arch"][::std::mem::align_of::<kvm_debug_exit_arch>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_guest_debug_arch {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_guest_debug_arch"][::std::mem::size_of::<kvm_guest_debug_arch>() - 0usize];
    ["Alignment of kvm_guest_debug_arch"][::std::mem::align_of::<kvm_guest_debug_arch>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_sync_regs {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_sync_regs"][::std::mem::size_of::<kvm_sync_regs>() - 0usize];
    ["Alignment of kvm_sync_regs"][::std::mem::align_of::<kvm_sync_regs>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_sregs {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_sregs"][::std::mem::size_of::<kvm_sregs>() - 0usize];
    ["Alignment of kvm_sregs"][::std::mem::align_of::<kvm_sregs>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_config {
    pub isa: ::std::os::raw::c_ulong,
    pub zicbom_block_size: ::std::os::raw::c_ulong,
    pub mvendorid: ::std::os::raw::c_ulong,
    pub marchid: ::std::os::raw::c_ulong,
    pub mimpid: ::std::os::raw::c_ulong,
    pub zicboz_block_size: ::std::os::raw::c_ulong,
    pub satp_mode: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_config"][::std::mem::size_of::<kvm_riscv_config>() - 56usize];
    ["Alignment of kvm_riscv_config"][::std::mem::align_of::<kvm_riscv_config>() - 8usize];
    ["Offset of field: kvm_riscv_config::isa"]
        [::std::mem::offset_of!(kvm_riscv_config, isa) - 0usize];
    ["Offset of field: kvm_riscv_config::zicbom_block_size"]
        [::std::mem::offset_of!(kvm_riscv_config, zicbom_block_size) - 8usize];
    ["Offset of field: kvm_riscv_config::mvendorid"]
        [::std::mem::offset_of!(kvm_riscv_config, mvendorid) - 16usize];
    ["Offset of field: kvm_riscv_config::marchid"]
        [::std::mem::offset_of!(kvm_riscv_config, marchid) - 24usize];
    ["Offset of field: kvm_riscv_config::mimpid"]
        [::std::mem::offset_of!(kvm_riscv_config, mimpid) - 32usize];
    ["Offset of field: kvm_riscv_config::zicboz_block_size"]
        [::std::mem::offset_of!(kvm_riscv_config, zicboz_block_size) - 40usize];
    ["Offset of field: kvm_riscv_config::satp_mode"]
        [::std::mem::offset_of!(kvm_riscv_config, satp_mode) - 48usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_core {
    pub regs: user_regs_struct,
    pub mode: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_core"][::std::mem::size_of::<kvm_riscv_core>() - 264usize];
    ["Alignment of kvm_riscv_core"][::std::mem::align_of::<kvm_riscv_core>() - 8usize];
    ["Offset of field: kvm_riscv_core::regs"]
        [::std::mem::offset_of!(kvm_riscv_core, regs) - 0usize];
    ["Offset of field: kvm_riscv_core::mode"]
        [::std::mem::offset_of!(kvm_riscv_core, mode) - 256usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_csr {
    pub sstatus: ::std::os::raw::c_ulong,
    pub sie: ::std::os::raw::c_ulong,
    pub stvec: ::std::os::raw::c_ulong,
    pub sscratch: ::std::os::raw::c_ulong,
    pub sepc: ::std::os::raw::c_ulong,
    pub scause: ::std::os::raw::c_ulong,
    pub stval: ::std::os::raw::c_ulong,
    pub sip: ::std::os::raw::c_ulong,
    pub satp: ::std::os::raw::c_ulong,
    pub scounteren: ::std::os::raw::c_ulong,
    pub senvcfg: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_csr"][::std::mem::size_of::<kvm_riscv_csr>() - 88usize];
    ["Alignment of kvm_riscv_csr"][::std::mem::align_of::<kvm_riscv_csr>() - 8usize];
    ["Offset of field: kvm_riscv_csr::sstatus"]
        [::std::mem::offset_of!(kvm_riscv_csr, sstatus) - 0usize];
    ["Offset of field: kvm_riscv_csr::sie"][::std::mem::offset_of!(kvm_riscv_csr, sie) - 8usize];
    ["Offset of field: kvm_riscv_csr::stvec"]
        [::std::mem::offset_of!(kvm_riscv_csr, stvec) - 16usize];
    ["Offset of field: kvm_riscv_csr::sscratch"]
        [::std::mem::offset_of!(kvm_riscv_csr, sscratch) - 24usize];
    ["Offset of field: kvm_riscv_csr::sepc"][::std::mem::offset_of!(kvm_riscv_csr, sepc) - 32usize];
    ["Offset of field: kvm_riscv_csr::scause"]
        [::std::mem::offset_of!(kvm_riscv_csr, scause) - 40usize];
    ["Offset of field: kvm_riscv_csr::stval"]
        [::std::mem::offset_of!(kvm_riscv_csr, stval) - 48usize];
    ["Offset of field: kvm_riscv_csr::sip"][::std::mem::offset_of!(kvm_riscv_csr, sip) - 56usize];
    ["Offset of field: kvm_riscv_csr::satp"][::std::mem::offset_of!(kvm_riscv_csr, satp) - 64usize];
    ["Offset of field: kvm_riscv_csr::scounteren"]
        [::std::mem::offset_of!(kvm_riscv_csr, scounteren) - 72usize];
    ["Offset of field: kvm_riscv_csr::senvcfg"]
        [::std::mem::offset_of!(kvm_riscv_csr, senvcfg) - 80usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_aia_csr {
    pub siselect: ::std::os::raw::c_ulong,
    pub iprio1: ::std::os::raw::c_ulong,
    pub iprio2: ::std::os::raw::c_ulong,
    pub sieh: ::std::os::raw::c_ulong,
    pub siph: ::std::os::raw::c_ulong,
    pub iprio1h: ::std::os::raw::c_ulong,
    pub iprio2h: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_aia_csr"][::std::mem::size_of::<kvm_riscv_aia_csr>() - 56usize];
    ["Alignment of kvm_riscv_aia_csr"][::std::mem::align_of::<kvm_riscv_aia_csr>() - 8usize];
    ["Offset of field: kvm_riscv_aia_csr::siselect"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, siselect) - 0usize];
    ["Offset of field: kvm_riscv_aia_csr::iprio1"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, iprio1) - 8usize];
    ["Offset of field: kvm_riscv_aia_csr::iprio2"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, iprio2) - 16usize];
    ["Offset of field: kvm_riscv_aia_csr::sieh"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, sieh) - 24usize];
    ["Offset of field: kvm_riscv_aia_csr::siph"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, siph) - 32usize];
    ["Offset of field: kvm_riscv_aia_csr::iprio1h"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, iprio1h) - 40usize];
    ["Offset of field: kvm_riscv_aia_csr::iprio2h"]
        [::std::mem::offset_of!(kvm_riscv_aia_csr, iprio2h) - 48usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_smstateen_csr {
    pub sstateen0: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_smstateen_csr"][::std::mem::size_of::<kvm_riscv_smstateen_csr>() - 8usize];
    ["Alignment of kvm_riscv_smstateen_csr"]
        [::std::mem::align_of::<kvm_riscv_smstateen_csr>() - 8usize];
    ["Offset of field: kvm_riscv_smstateen_csr::sstateen0"]
        [::std::mem::offset_of!(kvm_riscv_smstateen_csr, sstateen0) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_timer {
    pub frequency: __u64,
    pub time: __u64,
    pub compare: __u64,
    pub state: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_timer"][::std::mem::size_of::<kvm_riscv_timer>() - 32usize];
    ["Alignment of kvm_riscv_timer"][::std::mem::align_of::<kvm_riscv_timer>() - 8usize];
    ["Offset of field: kvm_riscv_timer::frequency"]
        [::std::mem::offset_of!(kvm_riscv_timer, frequency) - 0usize];
    ["Offset of field: kvm_riscv_timer::time"]
        [::std::mem::offset_of!(kvm_riscv_timer, time) - 8usize];
    ["Offset of field: kvm_riscv_timer::compare"]
        [::std::mem::offset_of!(kvm_riscv_timer, compare) - 16usize];
    ["Offset of field: kvm_riscv_timer::state"]
        [::std::mem::offset_of!(kvm_riscv_timer, state) - 24usize];
};
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_A: KVM_RISCV_ISA_EXT_ID = 0;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_C: KVM_RISCV_ISA_EXT_ID = 1;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_D: KVM_RISCV_ISA_EXT_ID = 2;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_F: KVM_RISCV_ISA_EXT_ID = 3;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_H: KVM_RISCV_ISA_EXT_ID = 4;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_I: KVM_RISCV_ISA_EXT_ID = 5;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_M: KVM_RISCV_ISA_EXT_ID = 6;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_SVPBMT: KVM_RISCV_ISA_EXT_ID = 7;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_SSTC: KVM_RISCV_ISA_EXT_ID = 8;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_SVINVAL: KVM_RISCV_ISA_EXT_ID = 9;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZIHINTPAUSE: KVM_RISCV_ISA_EXT_ID = 10;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZICBOM: KVM_RISCV_ISA_EXT_ID = 11;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZICBOZ: KVM_RISCV_ISA_EXT_ID = 12;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBB: KVM_RISCV_ISA_EXT_ID = 13;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_SSAIA: KVM_RISCV_ISA_EXT_ID = 14;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_V: KVM_RISCV_ISA_EXT_ID = 15;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_SVNAPOT: KVM_RISCV_ISA_EXT_ID = 16;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBA: KVM_RISCV_ISA_EXT_ID = 17;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBS: KVM_RISCV_ISA_EXT_ID = 18;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZICNTR: KVM_RISCV_ISA_EXT_ID = 19;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZICSR: KVM_RISCV_ISA_EXT_ID = 20;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZIFENCEI: KVM_RISCV_ISA_EXT_ID = 21;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZIHPM: KVM_RISCV_ISA_EXT_ID = 22;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_SMSTATEEN: KVM_RISCV_ISA_EXT_ID = 23;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZICOND: KVM_RISCV_ISA_EXT_ID = 24;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBC: KVM_RISCV_ISA_EXT_ID = 25;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBKB: KVM_RISCV_ISA_EXT_ID = 26;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBKC: KVM_RISCV_ISA_EXT_ID = 27;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZBKX: KVM_RISCV_ISA_EXT_ID = 28;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKND: KVM_RISCV_ISA_EXT_ID = 29;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKNE: KVM_RISCV_ISA_EXT_ID = 30;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKNH: KVM_RISCV_ISA_EXT_ID = 31;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKR: KVM_RISCV_ISA_EXT_ID = 32;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKSED: KVM_RISCV_ISA_EXT_ID = 33;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKSH: KVM_RISCV_ISA_EXT_ID = 34;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZKT: KVM_RISCV_ISA_EXT_ID = 35;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVBB: KVM_RISCV_ISA_EXT_ID = 36;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVBC: KVM_RISCV_ISA_EXT_ID = 37;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKB: KVM_RISCV_ISA_EXT_ID = 38;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKG: KVM_RISCV_ISA_EXT_ID = 39;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKNED: KVM_RISCV_ISA_EXT_ID = 40;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKNHA: KVM_RISCV_ISA_EXT_ID = 41;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKNHB: KVM_RISCV_ISA_EXT_ID = 42;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKSED: KVM_RISCV_ISA_EXT_ID = 43;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKSH: KVM_RISCV_ISA_EXT_ID = 44;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVKT: KVM_RISCV_ISA_EXT_ID = 45;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZFH: KVM_RISCV_ISA_EXT_ID = 46;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZFHMIN: KVM_RISCV_ISA_EXT_ID = 47;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZIHINTNTL: KVM_RISCV_ISA_EXT_ID = 48;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVFH: KVM_RISCV_ISA_EXT_ID = 49;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZVFHMIN: KVM_RISCV_ISA_EXT_ID = 50;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZFA: KVM_RISCV_ISA_EXT_ID = 51;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZTSO: KVM_RISCV_ISA_EXT_ID = 52;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_ZACAS: KVM_RISCV_ISA_EXT_ID = 53;
pub const KVM_RISCV_ISA_EXT_ID_KVM_RISCV_ISA_EXT_MAX: KVM_RISCV_ISA_EXT_ID = 54;
pub type KVM_RISCV_ISA_EXT_ID = ::std::os::raw::c_uint;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_V01: KVM_RISCV_SBI_EXT_ID = 0;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_TIME: KVM_RISCV_SBI_EXT_ID = 1;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_IPI: KVM_RISCV_SBI_EXT_ID = 2;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_RFENCE: KVM_RISCV_SBI_EXT_ID = 3;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_SRST: KVM_RISCV_SBI_EXT_ID = 4;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_HSM: KVM_RISCV_SBI_EXT_ID = 5;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_PMU: KVM_RISCV_SBI_EXT_ID = 6;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_EXPERIMENTAL: KVM_RISCV_SBI_EXT_ID = 7;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_VENDOR: KVM_RISCV_SBI_EXT_ID = 8;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_DBCN: KVM_RISCV_SBI_EXT_ID = 9;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_STA: KVM_RISCV_SBI_EXT_ID = 10;
pub const KVM_RISCV_SBI_EXT_ID_KVM_RISCV_SBI_EXT_MAX: KVM_RISCV_SBI_EXT_ID = 11;
pub type KVM_RISCV_SBI_EXT_ID = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_riscv_sbi_sta {
    pub shmem_lo: ::std::os::raw::c_ulong,
    pub shmem_hi: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_riscv_sbi_sta"][::std::mem::size_of::<kvm_riscv_sbi_sta>() - 16usize];
    ["Alignment of kvm_riscv_sbi_sta"][::std::mem::align_of::<kvm_riscv_sbi_sta>() - 8usize];
    ["Offset of field: kvm_riscv_sbi_sta::shmem_lo"]
        [::std::mem::offset_of!(kvm_riscv_sbi_sta, shmem_lo) - 0usize];
    ["Offset of field: kvm_riscv_sbi_sta::shmem_hi"]
        [::std::mem::offset_of!(kvm_riscv_sbi_sta, shmem_hi) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_userspace_memory_region {
    pub slot: __u32,
    pub flags: __u32,
    pub guest_phys_addr: __u64,
    pub memory_size: __u64,
    pub userspace_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_userspace_memory_region"]
        [::std::mem::size_of::<kvm_userspace_memory_region>() - 32usize];
    ["Alignment of kvm_userspace_memory_region"]
        [::std::mem::align_of::<kvm_userspace_memory_region>() - 8usize];
    ["Offset of field: kvm_userspace_memory_region::slot"]
        [::std::mem::offset_of!(kvm_userspace_memory_region, slot) - 0usize];
    ["Offset of field: kvm_userspace_memory_region::flags"]
        [::std::mem::offset_of!(kvm_userspace_memory_region, flags) - 4usize];
    ["Offset of field: kvm_userspace_memory_region::guest_phys_addr"]
        [::std::mem::offset_of!(kvm_userspace_memory_region, guest_phys_addr) - 8usize];
    ["Offset of field: kvm_userspace_memory_region::memory_size"]
        [::std::mem::offset_of!(kvm_userspace_memory_region, memory_size) - 16usize];
    ["Offset of field: kvm_userspace_memory_region::userspace_addr"]
        [::std::mem::offset_of!(kvm_userspace_memory_region, userspace_addr) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_userspace_memory_region2 {
    pub slot: __u32,
    pub flags: __u32,
    pub guest_phys_addr: __u64,
    pub memory_size: __u64,
    pub userspace_addr: __u64,
    pub guest_memfd_offset: __u64,
    pub guest_memfd: __u32,
    pub pad1: __u32,
    pub pad2: [__u64; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_userspace_memory_region2"]
        [::std::mem::size_of::<kvm_userspace_memory_region2>() - 160usize];
    ["Alignment of kvm_userspace_memory_region2"]
        [::std::mem::align_of::<kvm_userspace_memory_region2>() - 8usize];
    ["Offset of field: kvm_userspace_memory_region2::slot"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, slot) - 0usize];
    ["Offset of field: kvm_userspace_memory_region2::flags"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, flags) - 4usize];
    ["Offset of field: kvm_userspace_memory_region2::guest_phys_addr"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, guest_phys_addr) - 8usize];
    ["Offset of field: kvm_userspace_memory_region2::memory_size"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, memory_size) - 16usize];
    ["Offset of field: kvm_userspace_memory_region2::userspace_addr"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, userspace_addr) - 24usize];
    ["Offset of field: kvm_userspace_memory_region2::guest_memfd_offset"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, guest_memfd_offset) - 32usize];
    ["Offset of field: kvm_userspace_memory_region2::guest_memfd"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, guest_memfd) - 40usize];
    ["Offset of field: kvm_userspace_memory_region2::pad1"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, pad1) - 44usize];
    ["Offset of field: kvm_userspace_memory_region2::pad2"]
        [::std::mem::offset_of!(kvm_userspace_memory_region2, pad2) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_irq_level {
    pub __bindgen_anon_1: kvm_irq_level__bindgen_ty_1,
    pub level: __u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_irq_level__bindgen_ty_1 {
    pub irq: __u32,
    pub status: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_level__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_irq_level__bindgen_ty_1>() - 4usize];
    ["Alignment of kvm_irq_level__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_irq_level__bindgen_ty_1>() - 4usize];
    ["Offset of field: kvm_irq_level__bindgen_ty_1::irq"]
        [::std::mem::offset_of!(kvm_irq_level__bindgen_ty_1, irq) - 0usize];
    ["Offset of field: kvm_irq_level__bindgen_ty_1::status"]
        [::std::mem::offset_of!(kvm_irq_level__bindgen_ty_1, status) - 0usize];
};
impl Default for kvm_irq_level__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_level__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_irq_level__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_level"][::std::mem::size_of::<kvm_irq_level>() - 8usize];
    ["Alignment of kvm_irq_level"][::std::mem::align_of::<kvm_irq_level>() - 4usize];
    ["Offset of field: kvm_irq_level::level"]
        [::std::mem::offset_of!(kvm_irq_level, level) - 4usize];
};
impl Default for kvm_irq_level {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_level {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_irq_level {{ __bindgen_anon_1: {:?}, level: {:?} }}",
            self.__bindgen_anon_1, self.level
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_irqchip {
    pub chip_id: __u32,
    pub pad: __u32,
    pub chip: kvm_irqchip__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_irqchip__bindgen_ty_1 {
    pub dummy: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irqchip__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_irqchip__bindgen_ty_1>() - 512usize];
    ["Alignment of kvm_irqchip__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_irqchip__bindgen_ty_1>() - 1usize];
    ["Offset of field: kvm_irqchip__bindgen_ty_1::dummy"]
        [::std::mem::offset_of!(kvm_irqchip__bindgen_ty_1, dummy) - 0usize];
};
impl Default for kvm_irqchip__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irqchip__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_irqchip__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irqchip"][::std::mem::size_of::<kvm_irqchip>() - 520usize];
    ["Alignment of kvm_irqchip"][::std::mem::align_of::<kvm_irqchip>() - 4usize];
    ["Offset of field: kvm_irqchip::chip_id"]
        [::std::mem::offset_of!(kvm_irqchip, chip_id) - 0usize];
    ["Offset of field: kvm_irqchip::pad"][::std::mem::offset_of!(kvm_irqchip, pad) - 4usize];
    ["Offset of field: kvm_irqchip::chip"][::std::mem::offset_of!(kvm_irqchip, chip) - 8usize];
};
impl Default for kvm_irqchip {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irqchip {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_irqchip {{ chip_id: {:?}, pad: {:?}, chip: {:?} }}",
            self.chip_id, self.pad, self.chip
        )
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_pit_config {
    pub flags: __u32,
    pub pad: [__u32; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_pit_config"][::std::mem::size_of::<kvm_pit_config>() - 64usize];
    ["Alignment of kvm_pit_config"][::std::mem::align_of::<kvm_pit_config>() - 4usize];
    ["Offset of field: kvm_pit_config::flags"]
        [::std::mem::offset_of!(kvm_pit_config, flags) - 0usize];
    ["Offset of field: kvm_pit_config::pad"][::std::mem::offset_of!(kvm_pit_config, pad) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_hyperv_exit {
    pub type_: __u32,
    pub pad1: __u32,
    pub u: kvm_hyperv_exit__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_hyperv_exit__bindgen_ty_1 {
    pub synic: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1,
    pub hcall: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2,
    pub syndbg: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1 {
    pub msr: __u32,
    pub pad2: __u32,
    pub control: __u64,
    pub evt_page: __u64,
    pub msg_page: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    ["Alignment of kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1::msr"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1, msr) - 0usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1::pad2"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1, pad2) - 4usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1::control"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1, control) - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1::evt_page"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1, evt_page) - 16usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1::msg_page"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_1, msg_page) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2 {
    pub input: __u64,
    pub result: __u64,
    pub params: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2::input"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2, input) - 0usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2::result"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2, result) - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2::params"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_2, params) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3 {
    pub msr: __u32,
    pub pad2: __u32,
    pub control: __u64,
    pub status: __u64,
    pub send_page: __u64,
    pub recv_page: __u64,
    pub pending_page: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3>() - 48usize];
    ["Alignment of kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::msr"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3, msr) - 0usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::pad2"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3, pad2) - 4usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::control"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3, control) - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::status"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3, status) - 16usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::send_page"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3, send_page) - 24usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::recv_page"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3, recv_page) - 32usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3::pending_page"][::std::mem::offset_of!(
        kvm_hyperv_exit__bindgen_ty_1__bindgen_ty_3,
        pending_page
    ) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_hyperv_exit__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_hyperv_exit__bindgen_ty_1>() - 48usize];
    ["Alignment of kvm_hyperv_exit__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_hyperv_exit__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1::synic"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1, synic) - 0usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1::hcall"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1, hcall) - 0usize];
    ["Offset of field: kvm_hyperv_exit__bindgen_ty_1::syndbg"]
        [::std::mem::offset_of!(kvm_hyperv_exit__bindgen_ty_1, syndbg) - 0usize];
};
impl Default for kvm_hyperv_exit__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_hyperv_exit__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_hyperv_exit__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_hyperv_exit"][::std::mem::size_of::<kvm_hyperv_exit>() - 56usize];
    ["Alignment of kvm_hyperv_exit"][::std::mem::align_of::<kvm_hyperv_exit>() - 8usize];
    ["Offset of field: kvm_hyperv_exit::type_"]
        [::std::mem::offset_of!(kvm_hyperv_exit, type_) - 0usize];
    ["Offset of field: kvm_hyperv_exit::pad1"]
        [::std::mem::offset_of!(kvm_hyperv_exit, pad1) - 4usize];
    ["Offset of field: kvm_hyperv_exit::u"][::std::mem::offset_of!(kvm_hyperv_exit, u) - 8usize];
};
impl Default for kvm_hyperv_exit {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_hyperv_exit {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_hyperv_exit {{ type: {:?}, pad1: {:?}, u: {:?} }}",
            self.type_, self.pad1, self.u
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_xen_exit {
    pub type_: __u32,
    pub u: kvm_xen_exit__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_xen_exit__bindgen_ty_1 {
    pub hcall: kvm_xen_exit__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_xen_exit__bindgen_ty_1__bindgen_ty_1 {
    pub longmode: __u32,
    pub cpl: __u32,
    pub input: __u64,
    pub result: __u64,
    pub params: [__u64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_xen_exit__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_xen_exit__bindgen_ty_1__bindgen_ty_1>() - 72usize];
    ["Alignment of kvm_xen_exit__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_xen_exit__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_xen_exit__bindgen_ty_1__bindgen_ty_1::longmode"]
        [::std::mem::offset_of!(kvm_xen_exit__bindgen_ty_1__bindgen_ty_1, longmode) - 0usize];
    ["Offset of field: kvm_xen_exit__bindgen_ty_1__bindgen_ty_1::cpl"]
        [::std::mem::offset_of!(kvm_xen_exit__bindgen_ty_1__bindgen_ty_1, cpl) - 4usize];
    ["Offset of field: kvm_xen_exit__bindgen_ty_1__bindgen_ty_1::input"]
        [::std::mem::offset_of!(kvm_xen_exit__bindgen_ty_1__bindgen_ty_1, input) - 8usize];
    ["Offset of field: kvm_xen_exit__bindgen_ty_1__bindgen_ty_1::result"]
        [::std::mem::offset_of!(kvm_xen_exit__bindgen_ty_1__bindgen_ty_1, result) - 16usize];
    ["Offset of field: kvm_xen_exit__bindgen_ty_1__bindgen_ty_1::params"]
        [::std::mem::offset_of!(kvm_xen_exit__bindgen_ty_1__bindgen_ty_1, params) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_xen_exit__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_xen_exit__bindgen_ty_1>() - 72usize];
    ["Alignment of kvm_xen_exit__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_xen_exit__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_xen_exit__bindgen_ty_1::hcall"]
        [::std::mem::offset_of!(kvm_xen_exit__bindgen_ty_1, hcall) - 0usize];
};
impl Default for kvm_xen_exit__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_xen_exit__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_xen_exit__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_xen_exit"][::std::mem::size_of::<kvm_xen_exit>() - 80usize];
    ["Alignment of kvm_xen_exit"][::std::mem::align_of::<kvm_xen_exit>() - 8usize];
    ["Offset of field: kvm_xen_exit::type_"][::std::mem::offset_of!(kvm_xen_exit, type_) - 0usize];
    ["Offset of field: kvm_xen_exit::u"][::std::mem::offset_of!(kvm_xen_exit, u) - 8usize];
};
impl Default for kvm_xen_exit {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_xen_exit {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_xen_exit {{ type: {:?}, u: {:?} }}",
            self.type_, self.u
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_run {
    pub request_interrupt_window: __u8,
    pub immediate_exit: __u8,
    pub padding1: [__u8; 6usize],
    pub exit_reason: __u32,
    pub ready_for_interrupt_injection: __u8,
    pub if_flag: __u8,
    pub flags: __u16,
    pub cr8: __u64,
    pub apic_base: __u64,
    pub __bindgen_anon_1: kvm_run__bindgen_ty_1,
    pub kvm_valid_regs: __u64,
    pub kvm_dirty_regs: __u64,
    pub s: kvm_run__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_run__bindgen_ty_1 {
    pub hw: kvm_run__bindgen_ty_1__bindgen_ty_1,
    pub fail_entry: kvm_run__bindgen_ty_1__bindgen_ty_2,
    pub ex: kvm_run__bindgen_ty_1__bindgen_ty_3,
    pub io: kvm_run__bindgen_ty_1__bindgen_ty_4,
    pub debug: kvm_run__bindgen_ty_1__bindgen_ty_5,
    pub mmio: kvm_run__bindgen_ty_1__bindgen_ty_6,
    pub iocsr_io: kvm_run__bindgen_ty_1__bindgen_ty_7,
    pub hypercall: kvm_run__bindgen_ty_1__bindgen_ty_8,
    pub tpr_access: kvm_run__bindgen_ty_1__bindgen_ty_9,
    pub s390_sieic: kvm_run__bindgen_ty_1__bindgen_ty_10,
    pub s390_reset_flags: __u64,
    pub s390_ucontrol: kvm_run__bindgen_ty_1__bindgen_ty_11,
    pub dcr: kvm_run__bindgen_ty_1__bindgen_ty_12,
    pub internal: kvm_run__bindgen_ty_1__bindgen_ty_13,
    pub emulation_failure: kvm_run__bindgen_ty_1__bindgen_ty_14,
    pub osi: kvm_run__bindgen_ty_1__bindgen_ty_15,
    pub papr_hcall: kvm_run__bindgen_ty_1__bindgen_ty_16,
    pub s390_tsch: kvm_run__bindgen_ty_1__bindgen_ty_17,
    pub epr: kvm_run__bindgen_ty_1__bindgen_ty_18,
    pub system_event: kvm_run__bindgen_ty_1__bindgen_ty_19,
    pub s390_stsi: kvm_run__bindgen_ty_1__bindgen_ty_20,
    pub eoi: kvm_run__bindgen_ty_1__bindgen_ty_21,
    pub hyperv: kvm_hyperv_exit,
    pub arm_nisv: kvm_run__bindgen_ty_1__bindgen_ty_22,
    pub msr: kvm_run__bindgen_ty_1__bindgen_ty_23,
    pub xen: kvm_xen_exit,
    pub riscv_sbi: kvm_run__bindgen_ty_1__bindgen_ty_24,
    pub riscv_csr: kvm_run__bindgen_ty_1__bindgen_ty_25,
    pub notify: kvm_run__bindgen_ty_1__bindgen_ty_26,
    pub memory_fault: kvm_run__bindgen_ty_1__bindgen_ty_27,
    pub padding: [::std::os::raw::c_char; 256usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_1 {
    pub hardware_exit_reason: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_1::hardware_exit_reason"][::std::mem::offset_of!(
        kvm_run__bindgen_ty_1__bindgen_ty_1,
        hardware_exit_reason
    ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_2 {
    pub hardware_entry_failure_reason: __u64,
    pub cpu: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_2::hardware_entry_failure_reason"][::std::mem::offset_of!(
        kvm_run__bindgen_ty_1__bindgen_ty_2,
        hardware_entry_failure_reason
    )
        - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_2::cpu"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_2, cpu) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_3 {
    pub exception: __u32,
    pub error_code: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_3>() - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_3::exception"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_3, exception) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_3::error_code"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_3, error_code) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_4 {
    pub direction: __u8,
    pub size: __u8,
    pub port: __u16,
    pub count: __u32,
    pub data_offset: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_4::direction"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_4, direction) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_4::size"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_4, size) - 1usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_4::port"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_4, port) - 2usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_4::count"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_4, count) - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_4::data_offset"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_4, data_offset) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_5 {
    pub arch: kvm_debug_exit_arch,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_5>() - 0usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_5>() - 1usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_5::arch"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_5, arch) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_6 {
    pub phys_addr: __u64,
    pub data: [__u8; 8usize],
    pub len: __u32,
    pub is_write: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_6>() - 24usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_6::phys_addr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_6, phys_addr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_6::data"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_6, data) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_6::len"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_6, len) - 16usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_6::is_write"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_6, is_write) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_7 {
    pub phys_addr: __u64,
    pub data: [__u8; 8usize],
    pub len: __u32,
    pub is_write: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_7>() - 24usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_7>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_7::phys_addr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_7, phys_addr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_7::data"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_7, data) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_7::len"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_7, len) - 16usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_7::is_write"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_7, is_write) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_8 {
    pub nr: __u64,
    pub args: [__u64; 6usize],
    pub ret: __u64,
    pub __bindgen_anon_1: kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1 {
    pub longmode: __u32,
    pub flags: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1>() - 8usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1::longmode"][::std::mem::offset_of!(
        kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1,
        longmode
    ) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1, flags) - 0usize];
};
impl Default for kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_run__bindgen_ty_1__bindgen_ty_8__bindgen_ty_1 {{ union }}"
        )
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_8"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_8>() - 72usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_8"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_8>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_8::nr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_8, nr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_8::args"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_8, args) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_8::ret"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_8, ret) - 56usize];
};
impl Default for kvm_run__bindgen_ty_1__bindgen_ty_8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1__bindgen_ty_8 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_run__bindgen_ty_1__bindgen_ty_8 {{ nr: {:?}, args: {:?}, ret: {:?}, __bindgen_anon_1: {:?} }}" , self . nr , self . args , self . ret , self . __bindgen_anon_1)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_9 {
    pub rip: __u64,
    pub is_write: __u32,
    pub pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_9"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_9>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_9"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_9>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_9::rip"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_9, rip) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_9::is_write"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_9, is_write) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_9::pad"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_9, pad) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_10 {
    pub icptcode: __u8,
    pub ipa: __u16,
    pub ipb: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_10"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_10>() - 8usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_10"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_10>() - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_10::icptcode"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_10, icptcode) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_10::ipa"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_10, ipa) - 2usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_10::ipb"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_10, ipb) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_11 {
    pub trans_exc_code: __u64,
    pub pgm_code: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_11"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_11>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_11"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_11>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_11::trans_exc_code"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_11, trans_exc_code) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_11::pgm_code"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_11, pgm_code) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_12 {
    pub dcrn: __u32,
    pub data: __u32,
    pub is_write: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_12"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_12>() - 12usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_12"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_12>() - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_12::dcrn"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_12, dcrn) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_12::data"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_12, data) - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_12::is_write"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_12, is_write) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_13 {
    pub suberror: __u32,
    pub ndata: __u32,
    pub data: [__u64; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_13"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_13>() - 136usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_13"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_13>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_13::suberror"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_13, suberror) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_13::ndata"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_13, ndata) - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_13::data"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_13, data) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_14 {
    pub suberror: __u32,
    pub ndata: __u32,
    pub flags: __u64,
    pub __bindgen_anon_1: kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1 {
    pub __bindgen_anon_1: kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1 {
    pub insn_size: __u8,
    pub insn_bytes: [__u8; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1>(
        ) - 1usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1::insn_size"] [:: std :: mem :: offset_of ! (kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1 , insn_size) - 0usize] ;
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1::insn_bytes"] [:: std :: mem :: offset_of ! (kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1__bindgen_ty_1 , insn_bytes) - 1usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1>() - 1usize];
};
impl Default for kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_run__bindgen_ty_1__bindgen_ty_14__bindgen_ty_1 {{ union }}"
        )
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_14"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_14>() - 32usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_14"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_14>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_14::suberror"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_14, suberror) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_14::ndata"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_14, ndata) - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_14::flags"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_14, flags) - 8usize];
};
impl Default for kvm_run__bindgen_ty_1__bindgen_ty_14 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1__bindgen_ty_14 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_run__bindgen_ty_1__bindgen_ty_14 {{ suberror: {:?}, ndata: {:?}, flags: {:?}, __bindgen_anon_1: {:?} }}" , self . suberror , self . ndata , self . flags , self . __bindgen_anon_1)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_15 {
    pub gprs: [__u64; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_15"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_15>() - 256usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_15"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_15>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_15::gprs"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_15, gprs) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_16 {
    pub nr: __u64,
    pub ret: __u64,
    pub args: [__u64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_16"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_16>() - 88usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_16"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_16>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_16::nr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_16, nr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_16::ret"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_16, ret) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_16::args"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_16, args) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_17 {
    pub subchannel_id: __u16,
    pub subchannel_nr: __u16,
    pub io_int_parm: __u32,
    pub io_int_word: __u32,
    pub ipb: __u32,
    pub dequeued: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_17"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_17>() - 20usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_17"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_17>() - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_17::subchannel_id"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_17, subchannel_id) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_17::subchannel_nr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_17, subchannel_nr) - 2usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_17::io_int_parm"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_17, io_int_parm) - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_17::io_int_word"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_17, io_int_word) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_17::ipb"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_17, ipb) - 12usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_17::dequeued"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_17, dequeued) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_18 {
    pub epr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_18"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_18>() - 4usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_18"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_18>() - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_18::epr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_18, epr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_19 {
    pub type_: __u32,
    pub ndata: __u32,
    pub __bindgen_anon_1: kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1 {
    pub flags: __u64,
    pub data: [__u64; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1>() - 128usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1::flags"][::std::mem::offset_of!(
        kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1,
        flags
    ) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1::data"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1, data) - 0usize];
};
impl Default for kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_run__bindgen_ty_1__bindgen_ty_19__bindgen_ty_1 {{ union }}"
        )
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_19"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_19>() - 136usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_19"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_19>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_19::type_"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_19, type_) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_19::ndata"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_19, ndata) - 4usize];
};
impl Default for kvm_run__bindgen_ty_1__bindgen_ty_19 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1__bindgen_ty_19 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_run__bindgen_ty_1__bindgen_ty_19 {{ type: {:?}, ndata: {:?}, __bindgen_anon_1: {:?} }}" , self . type_ , self . ndata , self . __bindgen_anon_1)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_20 {
    pub addr: __u64,
    pub ar: __u8,
    pub reserved: __u8,
    pub fc: __u8,
    pub sel1: __u8,
    pub sel2: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_20"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_20>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_20"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_20>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_20::addr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_20, addr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_20::ar"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_20, ar) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_20::reserved"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_20, reserved) - 9usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_20::fc"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_20, fc) - 10usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_20::sel1"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_20, sel1) - 11usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_20::sel2"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_20, sel2) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_21 {
    pub vector: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_21"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_21>() - 1usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_21"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_21>() - 1usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_21::vector"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_21, vector) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_22 {
    pub esr_iss: __u64,
    pub fault_ipa: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_22"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_22>() - 16usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_22"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_22>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_22::esr_iss"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_22, esr_iss) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_22::fault_ipa"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_22, fault_ipa) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_23 {
    pub error: __u8,
    pub pad: [__u8; 7usize],
    pub reason: __u32,
    pub index: __u32,
    pub data: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_23"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_23>() - 24usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_23"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_23>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_23::error"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_23, error) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_23::pad"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_23, pad) - 1usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_23::reason"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_23, reason) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_23::index"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_23, index) - 12usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_23::data"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_23, data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_24 {
    pub extension_id: ::std::os::raw::c_ulong,
    pub function_id: ::std::os::raw::c_ulong,
    pub args: [::std::os::raw::c_ulong; 6usize],
    pub ret: [::std::os::raw::c_ulong; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_24"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_24>() - 80usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_24"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_24>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_24::extension_id"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_24, extension_id) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_24::function_id"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_24, function_id) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_24::args"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_24, args) - 16usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_24::ret"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_24, ret) - 64usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_25 {
    pub csr_num: ::std::os::raw::c_ulong,
    pub new_value: ::std::os::raw::c_ulong,
    pub write_mask: ::std::os::raw::c_ulong,
    pub ret_value: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_25"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_25>() - 32usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_25"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_25>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_25::csr_num"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_25, csr_num) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_25::new_value"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_25, new_value) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_25::write_mask"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_25, write_mask) - 16usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_25::ret_value"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_25, ret_value) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_26 {
    pub flags: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_26"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_26>() - 4usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_26"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_26>() - 4usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_26::flags"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_26, flags) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_run__bindgen_ty_1__bindgen_ty_27 {
    pub flags: __u64,
    pub gpa: __u64,
    pub size: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1__bindgen_ty_27"]
        [::std::mem::size_of::<kvm_run__bindgen_ty_1__bindgen_ty_27>() - 24usize];
    ["Alignment of kvm_run__bindgen_ty_1__bindgen_ty_27"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1__bindgen_ty_27>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_27::flags"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_27, flags) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_27::gpa"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_27, gpa) - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1__bindgen_ty_27::size"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1__bindgen_ty_27, size) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_1"][::std::mem::size_of::<kvm_run__bindgen_ty_1>() - 256usize];
    ["Alignment of kvm_run__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_run__bindgen_ty_1::hw"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, hw) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::fail_entry"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, fail_entry) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::ex"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, ex) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::io"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, io) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::debug"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, debug) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::mmio"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, mmio) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::iocsr_io"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, iocsr_io) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::hypercall"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, hypercall) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::tpr_access"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, tpr_access) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::s390_sieic"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, s390_sieic) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::s390_reset_flags"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, s390_reset_flags) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::s390_ucontrol"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, s390_ucontrol) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::dcr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, dcr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::internal"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, internal) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::emulation_failure"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, emulation_failure) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::osi"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, osi) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::papr_hcall"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, papr_hcall) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::s390_tsch"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, s390_tsch) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::epr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, epr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::system_event"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, system_event) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::s390_stsi"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, s390_stsi) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::eoi"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, eoi) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::hyperv"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, hyperv) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::arm_nisv"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, arm_nisv) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::msr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, msr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::xen"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, xen) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::riscv_sbi"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, riscv_sbi) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::riscv_csr"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, riscv_csr) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::notify"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, notify) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::memory_fault"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, memory_fault) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_1::padding"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_1, padding) - 0usize];
};
impl Default for kvm_run__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_run__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_run__bindgen_ty_2 {
    pub regs: kvm_sync_regs,
    pub padding: [::std::os::raw::c_char; 2048usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run__bindgen_ty_2"][::std::mem::size_of::<kvm_run__bindgen_ty_2>() - 2048usize];
    ["Alignment of kvm_run__bindgen_ty_2"]
        [::std::mem::align_of::<kvm_run__bindgen_ty_2>() - 1usize];
    ["Offset of field: kvm_run__bindgen_ty_2::regs"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_2, regs) - 0usize];
    ["Offset of field: kvm_run__bindgen_ty_2::padding"]
        [::std::mem::offset_of!(kvm_run__bindgen_ty_2, padding) - 0usize];
};
impl Default for kvm_run__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_run__bindgen_ty_2 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_run"][::std::mem::size_of::<kvm_run>() - 2352usize];
    ["Alignment of kvm_run"][::std::mem::align_of::<kvm_run>() - 8usize];
    ["Offset of field: kvm_run::request_interrupt_window"]
        [::std::mem::offset_of!(kvm_run, request_interrupt_window) - 0usize];
    ["Offset of field: kvm_run::immediate_exit"]
        [::std::mem::offset_of!(kvm_run, immediate_exit) - 1usize];
    ["Offset of field: kvm_run::padding1"][::std::mem::offset_of!(kvm_run, padding1) - 2usize];
    ["Offset of field: kvm_run::exit_reason"]
        [::std::mem::offset_of!(kvm_run, exit_reason) - 8usize];
    ["Offset of field: kvm_run::ready_for_interrupt_injection"]
        [::std::mem::offset_of!(kvm_run, ready_for_interrupt_injection) - 12usize];
    ["Offset of field: kvm_run::if_flag"][::std::mem::offset_of!(kvm_run, if_flag) - 13usize];
    ["Offset of field: kvm_run::flags"][::std::mem::offset_of!(kvm_run, flags) - 14usize];
    ["Offset of field: kvm_run::cr8"][::std::mem::offset_of!(kvm_run, cr8) - 16usize];
    ["Offset of field: kvm_run::apic_base"][::std::mem::offset_of!(kvm_run, apic_base) - 24usize];
    ["Offset of field: kvm_run::kvm_valid_regs"]
        [::std::mem::offset_of!(kvm_run, kvm_valid_regs) - 288usize];
    ["Offset of field: kvm_run::kvm_dirty_regs"]
        [::std::mem::offset_of!(kvm_run, kvm_dirty_regs) - 296usize];
    ["Offset of field: kvm_run::s"][::std::mem::offset_of!(kvm_run, s) - 304usize];
};
impl Default for kvm_run {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_run {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_run {{ request_interrupt_window: {:?}, immediate_exit: {:?}, padding1: {:?}, exit_reason: {:?}, ready_for_interrupt_injection: {:?}, if_flag: {:?}, flags: {:?}, cr8: {:?}, apic_base: {:?}, __bindgen_anon_1: {:?}, kvm_valid_regs: {:?}, kvm_dirty_regs: {:?}, s: {:?} }}" , self . request_interrupt_window , self . immediate_exit , self . padding1 , self . exit_reason , self . ready_for_interrupt_injection , self . if_flag , self . flags , self . cr8 , self . apic_base , self . __bindgen_anon_1 , self . kvm_valid_regs , self . kvm_dirty_regs , self . s)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_coalesced_mmio_zone {
    pub addr: __u64,
    pub size: __u32,
    pub __bindgen_anon_1: kvm_coalesced_mmio_zone__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_coalesced_mmio_zone__bindgen_ty_1 {
    pub pad: __u32,
    pub pio: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_coalesced_mmio_zone__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_coalesced_mmio_zone__bindgen_ty_1>() - 4usize];
    ["Alignment of kvm_coalesced_mmio_zone__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_coalesced_mmio_zone__bindgen_ty_1>() - 4usize];
    ["Offset of field: kvm_coalesced_mmio_zone__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_zone__bindgen_ty_1, pad) - 0usize];
    ["Offset of field: kvm_coalesced_mmio_zone__bindgen_ty_1::pio"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_zone__bindgen_ty_1, pio) - 0usize];
};
impl Default for kvm_coalesced_mmio_zone__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_coalesced_mmio_zone__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_coalesced_mmio_zone__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_coalesced_mmio_zone"][::std::mem::size_of::<kvm_coalesced_mmio_zone>() - 16usize];
    ["Alignment of kvm_coalesced_mmio_zone"]
        [::std::mem::align_of::<kvm_coalesced_mmio_zone>() - 8usize];
    ["Offset of field: kvm_coalesced_mmio_zone::addr"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_zone, addr) - 0usize];
    ["Offset of field: kvm_coalesced_mmio_zone::size"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_zone, size) - 8usize];
};
impl Default for kvm_coalesced_mmio_zone {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_coalesced_mmio_zone {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_coalesced_mmio_zone {{ addr: {:?}, size: {:?}, __bindgen_anon_1: {:?} }}",
            self.addr, self.size, self.__bindgen_anon_1
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_coalesced_mmio {
    pub phys_addr: __u64,
    pub len: __u32,
    pub __bindgen_anon_1: kvm_coalesced_mmio__bindgen_ty_1,
    pub data: [__u8; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_coalesced_mmio__bindgen_ty_1 {
    pub pad: __u32,
    pub pio: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_coalesced_mmio__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_coalesced_mmio__bindgen_ty_1>() - 4usize];
    ["Alignment of kvm_coalesced_mmio__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_coalesced_mmio__bindgen_ty_1>() - 4usize];
    ["Offset of field: kvm_coalesced_mmio__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_coalesced_mmio__bindgen_ty_1, pad) - 0usize];
    ["Offset of field: kvm_coalesced_mmio__bindgen_ty_1::pio"]
        [::std::mem::offset_of!(kvm_coalesced_mmio__bindgen_ty_1, pio) - 0usize];
};
impl Default for kvm_coalesced_mmio__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_coalesced_mmio__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_coalesced_mmio__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_coalesced_mmio"][::std::mem::size_of::<kvm_coalesced_mmio>() - 24usize];
    ["Alignment of kvm_coalesced_mmio"][::std::mem::align_of::<kvm_coalesced_mmio>() - 8usize];
    ["Offset of field: kvm_coalesced_mmio::phys_addr"]
        [::std::mem::offset_of!(kvm_coalesced_mmio, phys_addr) - 0usize];
    ["Offset of field: kvm_coalesced_mmio::len"]
        [::std::mem::offset_of!(kvm_coalesced_mmio, len) - 8usize];
    ["Offset of field: kvm_coalesced_mmio::data"]
        [::std::mem::offset_of!(kvm_coalesced_mmio, data) - 16usize];
};
impl Default for kvm_coalesced_mmio {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_coalesced_mmio {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_coalesced_mmio {{ phys_addr: {:?}, len: {:?}, __bindgen_anon_1: {:?}, data: {:?} }}" , self . phys_addr , self . len , self . __bindgen_anon_1 , self . data)
    }
}
#[repr(C)]
pub struct kvm_coalesced_mmio_ring {
    pub first: __u32,
    pub last: __u32,
    pub coalesced_mmio: __IncompleteArrayField<kvm_coalesced_mmio>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_coalesced_mmio_ring"][::std::mem::size_of::<kvm_coalesced_mmio_ring>() - 8usize];
    ["Alignment of kvm_coalesced_mmio_ring"]
        [::std::mem::align_of::<kvm_coalesced_mmio_ring>() - 8usize];
    ["Offset of field: kvm_coalesced_mmio_ring::first"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_ring, first) - 0usize];
    ["Offset of field: kvm_coalesced_mmio_ring::last"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_ring, last) - 4usize];
    ["Offset of field: kvm_coalesced_mmio_ring::coalesced_mmio"]
        [::std::mem::offset_of!(kvm_coalesced_mmio_ring, coalesced_mmio) - 8usize];
};
impl Default for kvm_coalesced_mmio_ring {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_coalesced_mmio_ring {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_coalesced_mmio_ring {{ first: {:?}, last: {:?}, coalesced_mmio: {:?} }}",
            self.first, self.last, self.coalesced_mmio
        )
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_translation {
    pub linear_address: __u64,
    pub physical_address: __u64,
    pub valid: __u8,
    pub writeable: __u8,
    pub usermode: __u8,
    pub pad: [__u8; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_translation"][::std::mem::size_of::<kvm_translation>() - 24usize];
    ["Alignment of kvm_translation"][::std::mem::align_of::<kvm_translation>() - 8usize];
    ["Offset of field: kvm_translation::linear_address"]
        [::std::mem::offset_of!(kvm_translation, linear_address) - 0usize];
    ["Offset of field: kvm_translation::physical_address"]
        [::std::mem::offset_of!(kvm_translation, physical_address) - 8usize];
    ["Offset of field: kvm_translation::valid"]
        [::std::mem::offset_of!(kvm_translation, valid) - 16usize];
    ["Offset of field: kvm_translation::writeable"]
        [::std::mem::offset_of!(kvm_translation, writeable) - 17usize];
    ["Offset of field: kvm_translation::usermode"]
        [::std::mem::offset_of!(kvm_translation, usermode) - 18usize];
    ["Offset of field: kvm_translation::pad"]
        [::std::mem::offset_of!(kvm_translation, pad) - 19usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_interrupt {
    pub irq: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_interrupt"][::std::mem::size_of::<kvm_interrupt>() - 4usize];
    ["Alignment of kvm_interrupt"][::std::mem::align_of::<kvm_interrupt>() - 4usize];
    ["Offset of field: kvm_interrupt::irq"][::std::mem::offset_of!(kvm_interrupt, irq) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_dirty_log {
    pub slot: __u32,
    pub padding1: __u32,
    pub __bindgen_anon_1: kvm_dirty_log__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_dirty_log__bindgen_ty_1 {
    pub dirty_bitmap: *mut ::std::os::raw::c_void,
    pub padding2: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_dirty_log__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_dirty_log__bindgen_ty_1>() - 8usize];
    ["Alignment of kvm_dirty_log__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_dirty_log__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_dirty_log__bindgen_ty_1::dirty_bitmap"]
        [::std::mem::offset_of!(kvm_dirty_log__bindgen_ty_1, dirty_bitmap) - 0usize];
    ["Offset of field: kvm_dirty_log__bindgen_ty_1::padding2"]
        [::std::mem::offset_of!(kvm_dirty_log__bindgen_ty_1, padding2) - 0usize];
};
impl Default for kvm_dirty_log__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_dirty_log__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_dirty_log__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_dirty_log"][::std::mem::size_of::<kvm_dirty_log>() - 16usize];
    ["Alignment of kvm_dirty_log"][::std::mem::align_of::<kvm_dirty_log>() - 8usize];
    ["Offset of field: kvm_dirty_log::slot"][::std::mem::offset_of!(kvm_dirty_log, slot) - 0usize];
    ["Offset of field: kvm_dirty_log::padding1"]
        [::std::mem::offset_of!(kvm_dirty_log, padding1) - 4usize];
};
impl Default for kvm_dirty_log {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_dirty_log {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_dirty_log {{ slot: {:?}, padding1: {:?}, __bindgen_anon_1: {:?} }}",
            self.slot, self.padding1, self.__bindgen_anon_1
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_clear_dirty_log {
    pub slot: __u32,
    pub num_pages: __u32,
    pub first_page: __u64,
    pub __bindgen_anon_1: kvm_clear_dirty_log__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_clear_dirty_log__bindgen_ty_1 {
    pub dirty_bitmap: *mut ::std::os::raw::c_void,
    pub padding2: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_clear_dirty_log__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_clear_dirty_log__bindgen_ty_1>() - 8usize];
    ["Alignment of kvm_clear_dirty_log__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_clear_dirty_log__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_clear_dirty_log__bindgen_ty_1::dirty_bitmap"]
        [::std::mem::offset_of!(kvm_clear_dirty_log__bindgen_ty_1, dirty_bitmap) - 0usize];
    ["Offset of field: kvm_clear_dirty_log__bindgen_ty_1::padding2"]
        [::std::mem::offset_of!(kvm_clear_dirty_log__bindgen_ty_1, padding2) - 0usize];
};
impl Default for kvm_clear_dirty_log__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_clear_dirty_log__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_clear_dirty_log__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_clear_dirty_log"][::std::mem::size_of::<kvm_clear_dirty_log>() - 24usize];
    ["Alignment of kvm_clear_dirty_log"][::std::mem::align_of::<kvm_clear_dirty_log>() - 8usize];
    ["Offset of field: kvm_clear_dirty_log::slot"]
        [::std::mem::offset_of!(kvm_clear_dirty_log, slot) - 0usize];
    ["Offset of field: kvm_clear_dirty_log::num_pages"]
        [::std::mem::offset_of!(kvm_clear_dirty_log, num_pages) - 4usize];
    ["Offset of field: kvm_clear_dirty_log::first_page"]
        [::std::mem::offset_of!(kvm_clear_dirty_log, first_page) - 8usize];
};
impl Default for kvm_clear_dirty_log {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_clear_dirty_log {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_clear_dirty_log {{ slot: {:?}, num_pages: {:?}, first_page: {:?}, __bindgen_anon_1: {:?} }}" , self . slot , self . num_pages , self . first_page , self . __bindgen_anon_1)
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct kvm_signal_mask {
    pub len: __u32,
    pub sigset: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_signal_mask"][::std::mem::size_of::<kvm_signal_mask>() - 4usize];
    ["Alignment of kvm_signal_mask"][::std::mem::align_of::<kvm_signal_mask>() - 4usize];
    ["Offset of field: kvm_signal_mask::len"]
        [::std::mem::offset_of!(kvm_signal_mask, len) - 0usize];
    ["Offset of field: kvm_signal_mask::sigset"]
        [::std::mem::offset_of!(kvm_signal_mask, sigset) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_tpr_access_ctl {
    pub enabled: __u32,
    pub flags: __u32,
    pub reserved: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_tpr_access_ctl"][::std::mem::size_of::<kvm_tpr_access_ctl>() - 40usize];
    ["Alignment of kvm_tpr_access_ctl"][::std::mem::align_of::<kvm_tpr_access_ctl>() - 4usize];
    ["Offset of field: kvm_tpr_access_ctl::enabled"]
        [::std::mem::offset_of!(kvm_tpr_access_ctl, enabled) - 0usize];
    ["Offset of field: kvm_tpr_access_ctl::flags"]
        [::std::mem::offset_of!(kvm_tpr_access_ctl, flags) - 4usize];
    ["Offset of field: kvm_tpr_access_ctl::reserved"]
        [::std::mem::offset_of!(kvm_tpr_access_ctl, reserved) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_vapic_addr {
    pub vapic_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vapic_addr"][::std::mem::size_of::<kvm_vapic_addr>() - 8usize];
    ["Alignment of kvm_vapic_addr"][::std::mem::align_of::<kvm_vapic_addr>() - 8usize];
    ["Offset of field: kvm_vapic_addr::vapic_addr"]
        [::std::mem::offset_of!(kvm_vapic_addr, vapic_addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_mp_state {
    pub mp_state: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_mp_state"][::std::mem::size_of::<kvm_mp_state>() - 4usize];
    ["Alignment of kvm_mp_state"][::std::mem::align_of::<kvm_mp_state>() - 4usize];
    ["Offset of field: kvm_mp_state::mp_state"]
        [::std::mem::offset_of!(kvm_mp_state, mp_state) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_guest_debug {
    pub control: __u32,
    pub pad: __u32,
    pub arch: kvm_guest_debug_arch,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_guest_debug"][::std::mem::size_of::<kvm_guest_debug>() - 8usize];
    ["Alignment of kvm_guest_debug"][::std::mem::align_of::<kvm_guest_debug>() - 4usize];
    ["Offset of field: kvm_guest_debug::control"]
        [::std::mem::offset_of!(kvm_guest_debug, control) - 0usize];
    ["Offset of field: kvm_guest_debug::pad"]
        [::std::mem::offset_of!(kvm_guest_debug, pad) - 4usize];
    ["Offset of field: kvm_guest_debug::arch"]
        [::std::mem::offset_of!(kvm_guest_debug, arch) - 8usize];
};
pub const kvm_ioeventfd_flag_nr_datamatch: _bindgen_ty_1 = 0;
pub const kvm_ioeventfd_flag_nr_pio: _bindgen_ty_1 = 1;
pub const kvm_ioeventfd_flag_nr_deassign: _bindgen_ty_1 = 2;
pub const kvm_ioeventfd_flag_nr_virtio_ccw_notify: _bindgen_ty_1 = 3;
pub const kvm_ioeventfd_flag_nr_fast_mmio: _bindgen_ty_1 = 4;
pub const kvm_ioeventfd_flag_nr_max: _bindgen_ty_1 = 5;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct kvm_ioeventfd {
    pub datamatch: __u64,
    pub addr: __u64,
    pub len: __u32,
    pub fd: __s32,
    pub flags: __u32,
    pub pad: [__u8; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_ioeventfd"][::std::mem::size_of::<kvm_ioeventfd>() - 64usize];
    ["Alignment of kvm_ioeventfd"][::std::mem::align_of::<kvm_ioeventfd>() - 8usize];
    ["Offset of field: kvm_ioeventfd::datamatch"]
        [::std::mem::offset_of!(kvm_ioeventfd, datamatch) - 0usize];
    ["Offset of field: kvm_ioeventfd::addr"][::std::mem::offset_of!(kvm_ioeventfd, addr) - 8usize];
    ["Offset of field: kvm_ioeventfd::len"][::std::mem::offset_of!(kvm_ioeventfd, len) - 16usize];
    ["Offset of field: kvm_ioeventfd::fd"][::std::mem::offset_of!(kvm_ioeventfd, fd) - 20usize];
    ["Offset of field: kvm_ioeventfd::flags"]
        [::std::mem::offset_of!(kvm_ioeventfd, flags) - 24usize];
    ["Offset of field: kvm_ioeventfd::pad"][::std::mem::offset_of!(kvm_ioeventfd, pad) - 28usize];
};
impl Default for kvm_ioeventfd {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct kvm_enable_cap {
    pub cap: __u32,
    pub flags: __u32,
    pub args: [__u64; 4usize],
    pub pad: [__u8; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_enable_cap"][::std::mem::size_of::<kvm_enable_cap>() - 104usize];
    ["Alignment of kvm_enable_cap"][::std::mem::align_of::<kvm_enable_cap>() - 8usize];
    ["Offset of field: kvm_enable_cap::cap"][::std::mem::offset_of!(kvm_enable_cap, cap) - 0usize];
    ["Offset of field: kvm_enable_cap::flags"]
        [::std::mem::offset_of!(kvm_enable_cap, flags) - 4usize];
    ["Offset of field: kvm_enable_cap::args"]
        [::std::mem::offset_of!(kvm_enable_cap, args) - 8usize];
    ["Offset of field: kvm_enable_cap::pad"][::std::mem::offset_of!(kvm_enable_cap, pad) - 40usize];
};
impl Default for kvm_enable_cap {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_irq_routing_irqchip {
    pub irqchip: __u32,
    pub pin: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_irqchip"][::std::mem::size_of::<kvm_irq_routing_irqchip>() - 8usize];
    ["Alignment of kvm_irq_routing_irqchip"]
        [::std::mem::align_of::<kvm_irq_routing_irqchip>() - 4usize];
    ["Offset of field: kvm_irq_routing_irqchip::irqchip"]
        [::std::mem::offset_of!(kvm_irq_routing_irqchip, irqchip) - 0usize];
    ["Offset of field: kvm_irq_routing_irqchip::pin"]
        [::std::mem::offset_of!(kvm_irq_routing_irqchip, pin) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_irq_routing_msi {
    pub address_lo: __u32,
    pub address_hi: __u32,
    pub data: __u32,
    pub __bindgen_anon_1: kvm_irq_routing_msi__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_irq_routing_msi__bindgen_ty_1 {
    pub pad: __u32,
    pub devid: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_msi__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_irq_routing_msi__bindgen_ty_1>() - 4usize];
    ["Alignment of kvm_irq_routing_msi__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_irq_routing_msi__bindgen_ty_1>() - 4usize];
    ["Offset of field: kvm_irq_routing_msi__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_irq_routing_msi__bindgen_ty_1, pad) - 0usize];
    ["Offset of field: kvm_irq_routing_msi__bindgen_ty_1::devid"]
        [::std::mem::offset_of!(kvm_irq_routing_msi__bindgen_ty_1, devid) - 0usize];
};
impl Default for kvm_irq_routing_msi__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_routing_msi__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_irq_routing_msi__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_msi"][::std::mem::size_of::<kvm_irq_routing_msi>() - 16usize];
    ["Alignment of kvm_irq_routing_msi"][::std::mem::align_of::<kvm_irq_routing_msi>() - 4usize];
    ["Offset of field: kvm_irq_routing_msi::address_lo"]
        [::std::mem::offset_of!(kvm_irq_routing_msi, address_lo) - 0usize];
    ["Offset of field: kvm_irq_routing_msi::address_hi"]
        [::std::mem::offset_of!(kvm_irq_routing_msi, address_hi) - 4usize];
    ["Offset of field: kvm_irq_routing_msi::data"]
        [::std::mem::offset_of!(kvm_irq_routing_msi, data) - 8usize];
};
impl Default for kvm_irq_routing_msi {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_routing_msi {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "kvm_irq_routing_msi {{ address_lo: {:?}, address_hi: {:?}, data: {:?}, __bindgen_anon_1: {:?} }}" , self . address_lo , self . address_hi , self . data , self . __bindgen_anon_1)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_irq_routing_s390_adapter {
    pub ind_addr: __u64,
    pub summary_addr: __u64,
    pub ind_offset: __u64,
    pub summary_offset: __u32,
    pub adapter_id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_s390_adapter"]
        [::std::mem::size_of::<kvm_irq_routing_s390_adapter>() - 32usize];
    ["Alignment of kvm_irq_routing_s390_adapter"]
        [::std::mem::align_of::<kvm_irq_routing_s390_adapter>() - 8usize];
    ["Offset of field: kvm_irq_routing_s390_adapter::ind_addr"]
        [::std::mem::offset_of!(kvm_irq_routing_s390_adapter, ind_addr) - 0usize];
    ["Offset of field: kvm_irq_routing_s390_adapter::summary_addr"]
        [::std::mem::offset_of!(kvm_irq_routing_s390_adapter, summary_addr) - 8usize];
    ["Offset of field: kvm_irq_routing_s390_adapter::ind_offset"]
        [::std::mem::offset_of!(kvm_irq_routing_s390_adapter, ind_offset) - 16usize];
    ["Offset of field: kvm_irq_routing_s390_adapter::summary_offset"]
        [::std::mem::offset_of!(kvm_irq_routing_s390_adapter, summary_offset) - 24usize];
    ["Offset of field: kvm_irq_routing_s390_adapter::adapter_id"]
        [::std::mem::offset_of!(kvm_irq_routing_s390_adapter, adapter_id) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_irq_routing_hv_sint {
    pub vcpu: __u32,
    pub sint: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_hv_sint"][::std::mem::size_of::<kvm_irq_routing_hv_sint>() - 8usize];
    ["Alignment of kvm_irq_routing_hv_sint"]
        [::std::mem::align_of::<kvm_irq_routing_hv_sint>() - 4usize];
    ["Offset of field: kvm_irq_routing_hv_sint::vcpu"]
        [::std::mem::offset_of!(kvm_irq_routing_hv_sint, vcpu) - 0usize];
    ["Offset of field: kvm_irq_routing_hv_sint::sint"]
        [::std::mem::offset_of!(kvm_irq_routing_hv_sint, sint) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_irq_routing_xen_evtchn {
    pub port: __u32,
    pub vcpu: __u32,
    pub priority: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_xen_evtchn"]
        [::std::mem::size_of::<kvm_irq_routing_xen_evtchn>() - 12usize];
    ["Alignment of kvm_irq_routing_xen_evtchn"]
        [::std::mem::align_of::<kvm_irq_routing_xen_evtchn>() - 4usize];
    ["Offset of field: kvm_irq_routing_xen_evtchn::port"]
        [::std::mem::offset_of!(kvm_irq_routing_xen_evtchn, port) - 0usize];
    ["Offset of field: kvm_irq_routing_xen_evtchn::vcpu"]
        [::std::mem::offset_of!(kvm_irq_routing_xen_evtchn, vcpu) - 4usize];
    ["Offset of field: kvm_irq_routing_xen_evtchn::priority"]
        [::std::mem::offset_of!(kvm_irq_routing_xen_evtchn, priority) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_irq_routing_entry {
    pub gsi: __u32,
    pub type_: __u32,
    pub flags: __u32,
    pub pad: __u32,
    pub u: kvm_irq_routing_entry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_irq_routing_entry__bindgen_ty_1 {
    pub irqchip: kvm_irq_routing_irqchip,
    pub msi: kvm_irq_routing_msi,
    pub adapter: kvm_irq_routing_s390_adapter,
    pub hv_sint: kvm_irq_routing_hv_sint,
    pub xen_evtchn: kvm_irq_routing_xen_evtchn,
    pub pad: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_entry__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_irq_routing_entry__bindgen_ty_1>() - 32usize];
    ["Alignment of kvm_irq_routing_entry__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_irq_routing_entry__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_irq_routing_entry__bindgen_ty_1::irqchip"]
        [::std::mem::offset_of!(kvm_irq_routing_entry__bindgen_ty_1, irqchip) - 0usize];
    ["Offset of field: kvm_irq_routing_entry__bindgen_ty_1::msi"]
        [::std::mem::offset_of!(kvm_irq_routing_entry__bindgen_ty_1, msi) - 0usize];
    ["Offset of field: kvm_irq_routing_entry__bindgen_ty_1::adapter"]
        [::std::mem::offset_of!(kvm_irq_routing_entry__bindgen_ty_1, adapter) - 0usize];
    ["Offset of field: kvm_irq_routing_entry__bindgen_ty_1::hv_sint"]
        [::std::mem::offset_of!(kvm_irq_routing_entry__bindgen_ty_1, hv_sint) - 0usize];
    ["Offset of field: kvm_irq_routing_entry__bindgen_ty_1::xen_evtchn"]
        [::std::mem::offset_of!(kvm_irq_routing_entry__bindgen_ty_1, xen_evtchn) - 0usize];
    ["Offset of field: kvm_irq_routing_entry__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_irq_routing_entry__bindgen_ty_1, pad) - 0usize];
};
impl Default for kvm_irq_routing_entry__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_routing_entry__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "kvm_irq_routing_entry__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing_entry"][::std::mem::size_of::<kvm_irq_routing_entry>() - 48usize];
    ["Alignment of kvm_irq_routing_entry"]
        [::std::mem::align_of::<kvm_irq_routing_entry>() - 8usize];
    ["Offset of field: kvm_irq_routing_entry::gsi"]
        [::std::mem::offset_of!(kvm_irq_routing_entry, gsi) - 0usize];
    ["Offset of field: kvm_irq_routing_entry::type_"]
        [::std::mem::offset_of!(kvm_irq_routing_entry, type_) - 4usize];
    ["Offset of field: kvm_irq_routing_entry::flags"]
        [::std::mem::offset_of!(kvm_irq_routing_entry, flags) - 8usize];
    ["Offset of field: kvm_irq_routing_entry::pad"]
        [::std::mem::offset_of!(kvm_irq_routing_entry, pad) - 12usize];
    ["Offset of field: kvm_irq_routing_entry::u"]
        [::std::mem::offset_of!(kvm_irq_routing_entry, u) - 16usize];
};
impl Default for kvm_irq_routing_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_routing_entry {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_irq_routing_entry {{ gsi: {:?}, type: {:?}, flags: {:?}, pad: {:?}, u: {:?} }}",
            self.gsi, self.type_, self.flags, self.pad, self.u
        )
    }
}
#[repr(C)]
pub struct kvm_irq_routing {
    pub nr: __u32,
    pub flags: __u32,
    pub entries: __IncompleteArrayField<kvm_irq_routing_entry>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irq_routing"][::std::mem::size_of::<kvm_irq_routing>() - 8usize];
    ["Alignment of kvm_irq_routing"][::std::mem::align_of::<kvm_irq_routing>() - 8usize];
    ["Offset of field: kvm_irq_routing::nr"][::std::mem::offset_of!(kvm_irq_routing, nr) - 0usize];
    ["Offset of field: kvm_irq_routing::flags"]
        [::std::mem::offset_of!(kvm_irq_routing, flags) - 4usize];
    ["Offset of field: kvm_irq_routing::entries"]
        [::std::mem::offset_of!(kvm_irq_routing, entries) - 8usize];
};
impl Default for kvm_irq_routing {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for kvm_irq_routing {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "kvm_irq_routing {{ nr: {:?}, flags: {:?}, entries: {:?} }}",
            self.nr, self.flags, self.entries
        )
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_irqfd {
    pub fd: __u32,
    pub gsi: __u32,
    pub flags: __u32,
    pub resamplefd: __u32,
    pub pad: [__u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_irqfd"][::std::mem::size_of::<kvm_irqfd>() - 32usize];
    ["Alignment of kvm_irqfd"][::std::mem::align_of::<kvm_irqfd>() - 4usize];
    ["Offset of field: kvm_irqfd::fd"][::std::mem::offset_of!(kvm_irqfd, fd) - 0usize];
    ["Offset of field: kvm_irqfd::gsi"][::std::mem::offset_of!(kvm_irqfd, gsi) - 4usize];
    ["Offset of field: kvm_irqfd::flags"][::std::mem::offset_of!(kvm_irqfd, flags) - 8usize];
    ["Offset of field: kvm_irqfd::resamplefd"]
        [::std::mem::offset_of!(kvm_irqfd, resamplefd) - 12usize];
    ["Offset of field: kvm_irqfd::pad"][::std::mem::offset_of!(kvm_irqfd, pad) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_clock_data {
    pub clock: __u64,
    pub flags: __u32,
    pub pad0: __u32,
    pub realtime: __u64,
    pub host_tsc: __u64,
    pub pad: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_clock_data"][::std::mem::size_of::<kvm_clock_data>() - 48usize];
    ["Alignment of kvm_clock_data"][::std::mem::align_of::<kvm_clock_data>() - 8usize];
    ["Offset of field: kvm_clock_data::clock"]
        [::std::mem::offset_of!(kvm_clock_data, clock) - 0usize];
    ["Offset of field: kvm_clock_data::flags"]
        [::std::mem::offset_of!(kvm_clock_data, flags) - 8usize];
    ["Offset of field: kvm_clock_data::pad0"]
        [::std::mem::offset_of!(kvm_clock_data, pad0) - 12usize];
    ["Offset of field: kvm_clock_data::realtime"]
        [::std::mem::offset_of!(kvm_clock_data, realtime) - 16usize];
    ["Offset of field: kvm_clock_data::host_tsc"]
        [::std::mem::offset_of!(kvm_clock_data, host_tsc) - 24usize];
    ["Offset of field: kvm_clock_data::pad"][::std::mem::offset_of!(kvm_clock_data, pad) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_config_tlb {
    pub params: __u64,
    pub array: __u64,
    pub mmu_type: __u32,
    pub array_len: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_config_tlb"][::std::mem::size_of::<kvm_config_tlb>() - 24usize];
    ["Alignment of kvm_config_tlb"][::std::mem::align_of::<kvm_config_tlb>() - 8usize];
    ["Offset of field: kvm_config_tlb::params"]
        [::std::mem::offset_of!(kvm_config_tlb, params) - 0usize];
    ["Offset of field: kvm_config_tlb::array"]
        [::std::mem::offset_of!(kvm_config_tlb, array) - 8usize];
    ["Offset of field: kvm_config_tlb::mmu_type"]
        [::std::mem::offset_of!(kvm_config_tlb, mmu_type) - 16usize];
    ["Offset of field: kvm_config_tlb::array_len"]
        [::std::mem::offset_of!(kvm_config_tlb, array_len) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_dirty_tlb {
    pub bitmap: __u64,
    pub num_dirty: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_dirty_tlb"][::std::mem::size_of::<kvm_dirty_tlb>() - 16usize];
    ["Alignment of kvm_dirty_tlb"][::std::mem::align_of::<kvm_dirty_tlb>() - 8usize];
    ["Offset of field: kvm_dirty_tlb::bitmap"]
        [::std::mem::offset_of!(kvm_dirty_tlb, bitmap) - 0usize];
    ["Offset of field: kvm_dirty_tlb::num_dirty"]
        [::std::mem::offset_of!(kvm_dirty_tlb, num_dirty) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct kvm_reg_list {
    pub n: __u64,
    pub reg: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_reg_list"][::std::mem::size_of::<kvm_reg_list>() - 8usize];
    ["Alignment of kvm_reg_list"][::std::mem::align_of::<kvm_reg_list>() - 8usize];
    ["Offset of field: kvm_reg_list::n"][::std::mem::offset_of!(kvm_reg_list, n) - 0usize];
    ["Offset of field: kvm_reg_list::reg"][::std::mem::offset_of!(kvm_reg_list, reg) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
#[cfg_attr(
    feature = "serde",
    derive(zerocopy::AsBytes, zerocopy::FromBytes, zerocopy::FromZeroes)
)]
pub struct kvm_one_reg {
    pub id: __u64,
    pub addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_one_reg"][::std::mem::size_of::<kvm_one_reg>() - 16usize];
    ["Alignment of kvm_one_reg"][::std::mem::align_of::<kvm_one_reg>() - 8usize];
    ["Offset of field: kvm_one_reg::id"][::std::mem::offset_of!(kvm_one_reg, id) - 0usize];
    ["Offset of field: kvm_one_reg::addr"][::std::mem::offset_of!(kvm_one_reg, addr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_msi {
    pub address_lo: __u32,
    pub address_hi: __u32,
    pub data: __u32,
    pub flags: __u32,
    pub devid: __u32,
    pub pad: [__u8; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_msi"][::std::mem::size_of::<kvm_msi>() - 32usize];
    ["Alignment of kvm_msi"][::std::mem::align_of::<kvm_msi>() - 4usize];
    ["Offset of field: kvm_msi::address_lo"][::std::mem::offset_of!(kvm_msi, address_lo) - 0usize];
    ["Offset of field: kvm_msi::address_hi"][::std::mem::offset_of!(kvm_msi, address_hi) - 4usize];
    ["Offset of field: kvm_msi::data"][::std::mem::offset_of!(kvm_msi, data) - 8usize];
    ["Offset of field: kvm_msi::flags"][::std::mem::offset_of!(kvm_msi, flags) - 12usize];
    ["Offset of field: kvm_msi::devid"][::std::mem::offset_of!(kvm_msi, devid) - 16usize];
    ["Offset of field: kvm_msi::pad"][::std::mem::offset_of!(kvm_msi, pad) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_arm_device_addr {
    pub id: __u64,
    pub addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_arm_device_addr"][::std::mem::size_of::<kvm_arm_device_addr>() - 16usize];
    ["Alignment of kvm_arm_device_addr"][::std::mem::align_of::<kvm_arm_device_addr>() - 8usize];
    ["Offset of field: kvm_arm_device_addr::id"]
        [::std::mem::offset_of!(kvm_arm_device_addr, id) - 0usize];
    ["Offset of field: kvm_arm_device_addr::addr"]
        [::std::mem::offset_of!(kvm_arm_device_addr, addr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_create_device {
    pub type_: __u32,
    pub fd: __u32,
    pub flags: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_create_device"][::std::mem::size_of::<kvm_create_device>() - 12usize];
    ["Alignment of kvm_create_device"][::std::mem::align_of::<kvm_create_device>() - 4usize];
    ["Offset of field: kvm_create_device::type_"]
        [::std::mem::offset_of!(kvm_create_device, type_) - 0usize];
    ["Offset of field: kvm_create_device::fd"]
        [::std::mem::offset_of!(kvm_create_device, fd) - 4usize];
    ["Offset of field: kvm_create_device::flags"]
        [::std::mem::offset_of!(kvm_create_device, flags) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_device_attr {
    pub flags: __u32,
    pub group: __u32,
    pub attr: __u64,
    pub addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_device_attr"][::std::mem::size_of::<kvm_device_attr>() - 24usize];
    ["Alignment of kvm_device_attr"][::std::mem::align_of::<kvm_device_attr>() - 8usize];
    ["Offset of field: kvm_device_attr::flags"]
        [::std::mem::offset_of!(kvm_device_attr, flags) - 0usize];
    ["Offset of field: kvm_device_attr::group"]
        [::std::mem::offset_of!(kvm_device_attr, group) - 4usize];
    ["Offset of field: kvm_device_attr::attr"]
        [::std::mem::offset_of!(kvm_device_attr, attr) - 8usize];
    ["Offset of field: kvm_device_attr::addr"]
        [::std::mem::offset_of!(kvm_device_attr, addr) - 16usize];
};
pub const kvm_device_type_KVM_DEV_TYPE_FSL_MPIC_20: kvm_device_type = 1;
pub const kvm_device_type_KVM_DEV_TYPE_FSL_MPIC_42: kvm_device_type = 2;
pub const kvm_device_type_KVM_DEV_TYPE_XICS: kvm_device_type = 3;
pub const kvm_device_type_KVM_DEV_TYPE_VFIO: kvm_device_type = 4;
pub const kvm_device_type_KVM_DEV_TYPE_ARM_VGIC_V2: kvm_device_type = 5;
pub const kvm_device_type_KVM_DEV_TYPE_FLIC: kvm_device_type = 6;
pub const kvm_device_type_KVM_DEV_TYPE_ARM_VGIC_V3: kvm_device_type = 7;
pub const kvm_device_type_KVM_DEV_TYPE_ARM_VGIC_ITS: kvm_device_type = 8;
pub const kvm_device_type_KVM_DEV_TYPE_XIVE: kvm_device_type = 9;
pub const kvm_device_type_KVM_DEV_TYPE_ARM_PV_TIME: kvm_device_type = 10;
pub const kvm_device_type_KVM_DEV_TYPE_RISCV_AIA: kvm_device_type = 11;
pub const kvm_device_type_KVM_DEV_TYPE_MAX: kvm_device_type = 12;
pub type kvm_device_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_vfio_spapr_tce {
    pub groupfd: __s32,
    pub tablefd: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vfio_spapr_tce"][::std::mem::size_of::<kvm_vfio_spapr_tce>() - 8usize];
    ["Alignment of kvm_vfio_spapr_tce"][::std::mem::align_of::<kvm_vfio_spapr_tce>() - 4usize];
    ["Offset of field: kvm_vfio_spapr_tce::groupfd"]
        [::std::mem::offset_of!(kvm_vfio_spapr_tce, groupfd) - 0usize];
    ["Offset of field: kvm_vfio_spapr_tce::tablefd"]
        [::std::mem::offset_of!(kvm_vfio_spapr_tce, tablefd) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_enc_region {
    pub addr: __u64,
    pub size: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_enc_region"][::std::mem::size_of::<kvm_enc_region>() - 16usize];
    ["Alignment of kvm_enc_region"][::std::mem::align_of::<kvm_enc_region>() - 8usize];
    ["Offset of field: kvm_enc_region::addr"]
        [::std::mem::offset_of!(kvm_enc_region, addr) - 0usize];
    ["Offset of field: kvm_enc_region::size"]
        [::std::mem::offset_of!(kvm_enc_region, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_dirty_gfn {
    pub flags: __u32,
    pub slot: __u32,
    pub offset: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_dirty_gfn"][::std::mem::size_of::<kvm_dirty_gfn>() - 16usize];
    ["Alignment of kvm_dirty_gfn"][::std::mem::align_of::<kvm_dirty_gfn>() - 8usize];
    ["Offset of field: kvm_dirty_gfn::flags"]
        [::std::mem::offset_of!(kvm_dirty_gfn, flags) - 0usize];
    ["Offset of field: kvm_dirty_gfn::slot"][::std::mem::offset_of!(kvm_dirty_gfn, slot) - 4usize];
    ["Offset of field: kvm_dirty_gfn::offset"]
        [::std::mem::offset_of!(kvm_dirty_gfn, offset) - 8usize];
};
#[doc = " struct kvm_stats_header - Header of per vm/vcpu binary statistics data.\n @flags: Some extra information for header, always 0 for now.\n @name_size: The size in bytes of the memory which contains statistics\n             name string including trailing '\\0'. The memory is allocated\n             at the send of statistics descriptor.\n @num_desc: The number of statistics the vm or vcpu has.\n @id_offset: The offset of the vm/vcpu stats' id string in the file pointed\n             by vm/vcpu stats fd.\n @desc_offset: The offset of the vm/vcpu stats' descriptor block in the file\n               pointd by vm/vcpu stats fd.\n @data_offset: The offset of the vm/vcpu stats' data block in the file\n               pointed by vm/vcpu stats fd.\n\n This is the header userspace needs to read from stats fd before any other\n readings. It is used by userspace to discover all the information about the\n vm/vcpu's binary statistics.\n Userspace reads this header from the start of the vm/vcpu's stats fd."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_stats_header {
    pub flags: __u32,
    pub name_size: __u32,
    pub num_desc: __u32,
    pub id_offset: __u32,
    pub desc_offset: __u32,
    pub data_offset: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_stats_header"][::std::mem::size_of::<kvm_stats_header>() - 24usize];
    ["Alignment of kvm_stats_header"][::std::mem::align_of::<kvm_stats_header>() - 4usize];
    ["Offset of field: kvm_stats_header::flags"]
        [::std::mem::offset_of!(kvm_stats_header, flags) - 0usize];
    ["Offset of field: kvm_stats_header::name_size"]
        [::std::mem::offset_of!(kvm_stats_header, name_size) - 4usize];
    ["Offset of field: kvm_stats_header::num_desc"]
        [::std::mem::offset_of!(kvm_stats_header, num_desc) - 8usize];
    ["Offset of field: kvm_stats_header::id_offset"]
        [::std::mem::offset_of!(kvm_stats_header, id_offset) - 12usize];
    ["Offset of field: kvm_stats_header::desc_offset"]
        [::std::mem::offset_of!(kvm_stats_header, desc_offset) - 16usize];
    ["Offset of field: kvm_stats_header::data_offset"]
        [::std::mem::offset_of!(kvm_stats_header, data_offset) - 20usize];
};
#[doc = " struct kvm_stats_desc - Descriptor of a KVM statistics.\n @flags: Annotations of the stats, like type, unit, etc.\n @exponent: Used together with @flags to determine the unit.\n @size: The number of data items for this stats.\n        Every data item is of type __u64.\n @offset: The offset of the stats to the start of stat structure in\n          structure kvm or kvm_vcpu.\n @bucket_size: A parameter value used for histogram stats. It is only used\n\t\tfor linear histogram stats, specifying the size of the bucket;\n @name: The name string for the stats. Its size is indicated by the\n        &kvm_stats_header->name_size."]
#[repr(C)]
#[derive(Debug, Default)]
pub struct kvm_stats_desc {
    pub flags: __u32,
    pub exponent: __s16,
    pub size: __u16,
    pub offset: __u32,
    pub bucket_size: __u32,
    pub name: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_stats_desc"][::std::mem::size_of::<kvm_stats_desc>() - 16usize];
    ["Alignment of kvm_stats_desc"][::std::mem::align_of::<kvm_stats_desc>() - 4usize];
    ["Offset of field: kvm_stats_desc::flags"]
        [::std::mem::offset_of!(kvm_stats_desc, flags) - 0usize];
    ["Offset of field: kvm_stats_desc::exponent"]
        [::std::mem::offset_of!(kvm_stats_desc, exponent) - 4usize];
    ["Offset of field: kvm_stats_desc::size"]
        [::std::mem::offset_of!(kvm_stats_desc, size) - 6usize];
    ["Offset of field: kvm_stats_desc::offset"]
        [::std::mem::offset_of!(kvm_stats_desc, offset) - 8usize];
    ["Offset of field: kvm_stats_desc::bucket_size"]
        [::std::mem::offset_of!(kvm_stats_desc, bucket_size) - 12usize];
    ["Offset of field: kvm_stats_desc::name"]
        [::std::mem::offset_of!(kvm_stats_desc, name) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_memory_attributes {
    pub address: __u64,
    pub size: __u64,
    pub attributes: __u64,
    pub flags: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_memory_attributes"][::std::mem::size_of::<kvm_memory_attributes>() - 32usize];
    ["Alignment of kvm_memory_attributes"]
        [::std::mem::align_of::<kvm_memory_attributes>() - 8usize];
    ["Offset of field: kvm_memory_attributes::address"]
        [::std::mem::offset_of!(kvm_memory_attributes, address) - 0usize];
    ["Offset of field: kvm_memory_attributes::size"]
        [::std::mem::offset_of!(kvm_memory_attributes, size) - 8usize];
    ["Offset of field: kvm_memory_attributes::attributes"]
        [::std::mem::offset_of!(kvm_memory_attributes, attributes) - 16usize];
    ["Offset of field: kvm_memory_attributes::flags"]
        [::std::mem::offset_of!(kvm_memory_attributes, flags) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct kvm_create_guest_memfd {
    pub size: __u64,
    pub flags: __u64,
    pub reserved: [__u64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_create_guest_memfd"][::std::mem::size_of::<kvm_create_guest_memfd>() - 64usize];
    ["Alignment of kvm_create_guest_memfd"]
        [::std::mem::align_of::<kvm_create_guest_memfd>() - 8usize];
    ["Offset of field: kvm_create_guest_memfd::size"]
        [::std::mem::offset_of!(kvm_create_guest_memfd, size) - 0usize];
    ["Offset of field: kvm_create_guest_memfd::flags"]
        [::std::mem::offset_of!(kvm_create_guest_memfd, flags) - 8usize];
    ["Offset of field: kvm_create_guest_memfd::reserved"]
        [::std::mem::offset_of!(kvm_create_guest_memfd, reserved) - 16usize];
};
